/*
* Copyright (C) 2016 MediaTek Inc.
*
* This program is free software; you can redistribute it and/or modify
* it under the terms of the GNU General Public License version 2 as
* published by the Free Software Foundation.
*
* This program is distributed in the hope that it will be useful,
* but WITHOUT ANY WARRANTY; without even the implied warranty of
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
* See http://www.gnu.org/licenses/gpl-2.0.html for more details.
*/

/******************************************************************************
 * camera_isp.c - MT6799 Linux ISP Device Driver
 *
 * DESCRIPTION:
 *     This file provid the other drivers ISP relative functions
 *
 ******************************************************************************/
/* MET: define to enable MET*/
#define ISP_MET_READY

#include <linux/types.h>
#include <linux/device.h>
#include <linux/cdev.h>
#include <linux/platform_device.h>
#include <linux/interrupt.h>
/* #include <asm/io.h> */
/* #include <asm/tcm.h> */
#include <linux/proc_fs.h>  /* proc file use */
/*      */
#include <linux/slab.h>
#include <linux/spinlock.h>
/* #include <linux/io.h> */
#include <linux/delay.h>
#include <linux/uaccess.h>
#include <linux/atomic.h>
#include <linux/sched.h>
#include <linux/mm.h>

/*#include <mach/hardware.h>*/
/* #include <mach/mt6593_pll.h> */
/* #include <mach/camera_isp.h> */
/*#include <mach/mt_reg_base.h> */

/*#include <mach/irqs.h>*/

#define IMGO_DONE_ST        (1L<<0)
#define UFEO_DONE_ST        (1L<<1)
#define RRZO_DONE_ST        (1L<<2)
#define EISO_DONE_ST        (1L<<3)
#define FLKO_DONE_ST        (1L<<4)
#define AFO_DONE_ST         (1L<<5)
#define LCSO_DONE_ST        (1L<<6)
#define AAO_DONE_ST         (1L<<7)
#define BPCI_DONE_ST        (1L<<9)
#define LSCI_DONE_ST        (1L<<10)
/* #define CACI_DONE_ST        (1L<<11) */
#define PDO_DONE_ST         (1L<<13)
#define PSO_DONE_ST         (1L<<14)
/**
 *    CAMSV interrupt status
 */
/* normal signal */
#define SV_VS1_ST           (1L<<0)
#define SV_TG_ST1           (1L<<1)
#define SV_TG_ST2           (1L<<2)
#define SV_EXPDON_ST        (1L<<3)
#define SV_SOF_INT_ST       (1L<<7)
#define SV_HW_PASS1_DON_ST  (1L<<10)
#define SV_SW_PASS1_DON_ST  (1L<<20)
/* err status */
#define SV_TG_ERR           (1L<<4)
#define SV_TG_GBERR         (1L<<5)
#define SV_IMGO_ERR         (1L<<16)
#define SV_IMGO_OVERRUN     (1L<<17)

/**
 *    IRQ signal mask
 */
#define INT_ST_MASK_CAM     ( \
			      VS_INT_ST |\
			      TG_INT1_ST |\
			      TG_INT2_ST |\
			      EXPDON_ST |\
			      HW_PASS1_DON_ST |\
			      SOF_INT_ST |\
			      SW_PASS1_DON_ST)
/**
 *    dma done mask
 */
#define DMA_ST_MASK_CAM     (\
			     IMGO_DONE_ST |\
			     UFEO_DONE_ST |\
			     RRZO_DONE_ST |\
			     EISO_DONE_ST |\
			     FLKO_DONE_ST |\
			     AFO_DONE_ST |\
			     LCSO_DONE_ST |\
			     AAO_DONE_ST |\
			     BPCI_DONE_ST |\
			     LSCI_DONE_ST |\
			     PDO_DONE_ST | \
			     PSO_DONE_ST)

/**
 *    IRQ Warning Mask
 */
#define INT_ST_MASK_CAM_WARN    (\
				 RRZO_ERR_ST |\
				 AFO_ERR_ST |\
				 IMGO_ERR_ST |\
				 AAO_ERR_ST |\
				 PSO_ERR_ST | \
				 LCSO_ERR_ST |\
				 BNR_ERR_ST |\
				 LSC_ERR_ST)

/**
 *    IRQ Error Mask
 */
#define INT_ST_MASK_CAM_ERR     (\
				 TG_ERR_ST |\
				 TG_GBERR_ST |\
				 CQ_CODE_ERR_ST |\
				 CQ_APB_ERR_ST |\
				 CQ_VS_ERR_ST |\
				 AMX_ERR_ST |\
				 RMX_ERR_ST |\
				 BMX_ERR_ST |\
				 BNR_ERR_ST |\
				 LSC_ERR_ST |\
				 DMA_ERR_ST)


/**
 *    IRQ signal mask
 */
#define INT_ST_MASK_CAMSV       (\
				 SV_VS1_ST |\
				 SV_TG_ST1 |\
				 SV_TG_ST2 |\
				 SV_EXPDON_ST |\
				 SV_SOF_INT_ST |\
				 SV_HW_PASS1_DON_ST |\
				 SV_SW_PASS1_DON_ST)
/**
 *    IRQ Error Mask
 */
#define INT_ST_MASK_CAMSV_ERR   (\
				 SV_TG_ERR |\
				 SV_TG_GBERR |\
				 SV_IMGO_ERR |\
				 SV_IMGO_OVERRUN)

static irqreturn_t ISP_Irq_CAM_A(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAM_B(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_0(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_1(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_2(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_3(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_4(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_CAMSV_5(MINT32  Irq, void *DeviceId);
static irqreturn_t ISP_Irq_DIP_A(MINT32  Irq, void *DeviceId);


typedef irqreturn_t (*IRQ_CB)(MINT32, void *);

typedef struct {
	IRQ_CB          isr_fp;
	unsigned int    int_number;
	char            device_name[16];
} ISR_TABLE;

#ifndef CONFIG_OF
const ISR_TABLE IRQ_CB_TBL[ISP_IRQ_TYPE_AMOUNT] = {
	{ISP_Irq_CAM_A,     CAM0_IRQ_BIT_ID,    "CAM_A"},
	{NULL,                            0,    "CAM_B"},
	{NULL,                            0,    "DIP_A"},
	{ISP_Irq_CAMSV_0,   CAM_SV0_IRQ_BIT_ID, "CAMSV_0"},
	{ISP_Irq_CAMSV_1,   CAM_SV1_IRQ_BIT_ID, "CAMSV_1"},
	{NULL,                               0,     "UNI"}
};

#else
/* int number is got from kernel api */

const ISR_TABLE IRQ_CB_TBL[ISP_IRQ_TYPE_AMOUNT] = {
#if DUMMY_INT
	{ISP_Irq_CAM_A,     0,  "cam2-dummy"}, /* Must be the same name with that in device node. */
	{ISP_Irq_CAM_B,     0,  "cam3-dummy"},
	{ISP_Irq_DIP_A,     0,  "dip-dummy"},
	{ISP_Irq_CAMSV_0,   0,  "camsv1-dummy"},
	{ISP_Irq_CAMSV_1,   0,  "camsv2-dummy"},
	{ISP_Irq_CAMSV_2,   0,  "camsv3-dummy"},
	{ISP_Irq_CAMSV_3,   0,  "camsv4-dummy"},
	{ISP_Irq_CAMSV_4,   0,  "camsv5-dummy"},
	{ISP_Irq_CAMSV_5,   0,  "camsv6-dummy"},
	{NULL,              0,  "cam1-dummy"} /* UNI */
#else
	{ISP_Irq_CAM_A,     0,  "cam2"}, /* Must be the same name with that in device node. */
	{ISP_Irq_CAM_B,     0,  "cam3"},
	{ISP_Irq_DIP_A,     0,  "dip"},
	{ISP_Irq_CAMSV_0,   0,  "camsv1"},
	{ISP_Irq_CAMSV_1,   0,  "camsv2"},
	{ISP_Irq_CAMSV_2,   0,  "camsv3"},
	{ISP_Irq_CAMSV_3,   0,  "camsv4"},
	{ISP_Irq_CAMSV_4,   0,  "camsv5"},
	{ISP_Irq_CAMSV_5,   0,  "camsv6"},
	{NULL,              0,  "cam1"} /* UNI */
#endif
};

/*
 * Note!!! The order and member of .compatible must be the same with that in
 *  "ISP_DEV_NODE_ENUM" in camera_isp.h
 */
static const struct of_device_id isp_of_ids[] = {
	{ .compatible = "mediatek,mt6799-imgsys", },
	{ .compatible = "mediatek,dip", }, /* Remider: Add this device node manually in .dtsi */
	{ .compatible = "mediatek,camsys", },
	{ .compatible = "mediatek,cam1", },
	{ .compatible = "mediatek,cam2", },
	{ .compatible = "mediatek,cam3", },
	{ .compatible = "mediatek,camsv1", },
	{ .compatible = "mediatek,camsv2", },
	{ .compatible = "mediatek,camsv3", },
	{ .compatible = "mediatek,camsv4", },
	{ .compatible = "mediatek,camsv5", },
	{ .compatible = "mediatek,camsv6", },
	{}
};

#endif
/* //////////////////////////////////////////////////////////////////////////////////////////// */
/*  */
typedef void (*tasklet_cb)(unsigned long);
typedef struct {
	tasklet_cb tkt_cb;
	struct tasklet_struct  *pIsp_tkt;
} Tasklet_table;

struct tasklet_struct tkt[ISP_IRQ_TYPE_AMOUNT];

static void ISP_TaskletFunc_CAM_A(unsigned long data);
static void ISP_TaskletFunc_CAM_B(unsigned long data);
static void ISP_TaskletFunc_SV_0(unsigned long data);
static void ISP_TaskletFunc_SV_1(unsigned long data);
static void ISP_TaskletFunc_SV_2(unsigned long data);
static void ISP_TaskletFunc_SV_3(unsigned long data);
static void ISP_TaskletFunc_SV_4(unsigned long data);
static void ISP_TaskletFunc_SV_5(unsigned long data);

static Tasklet_table isp_tasklet[ISP_IRQ_TYPE_AMOUNT] = {
	{ISP_TaskletFunc_CAM_A, &tkt[ISP_IRQ_TYPE_INT_CAM_A_ST]},
	{ISP_TaskletFunc_CAM_B, &tkt[ISP_IRQ_TYPE_INT_CAM_B_ST]},
	{NULL,                  &tkt[ISP_IRQ_TYPE_INT_DIP_A_ST]},
	{ISP_TaskletFunc_SV_0,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_0_ST]},
	{ISP_TaskletFunc_SV_1,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_1_ST]},
	{ISP_TaskletFunc_SV_2,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_2_ST]},
	{ISP_TaskletFunc_SV_3,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_3_ST]},
	{ISP_TaskletFunc_SV_4,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_4_ST]},
	{ISP_TaskletFunc_SV_5,  &tkt[ISP_IRQ_TYPE_INT_CAMSV_5_ST]},
	{NULL,                  &tkt[ISP_IRQ_TYPE_INT_UNI_A_ST]}
};

#if (ISP_BOTTOMHALF_WORKQ == 1)
typedef struct {
	ISP_IRQ_TYPE_ENUM	module;
	struct work_struct  isp_bh_work;
} IspWorkqueTable;

static void ISP_BH_Workqueue(struct work_struct *pWork);

static IspWorkqueTable isp_workque[ISP_IRQ_TYPE_AMOUNT] = {
	{ISP_IRQ_TYPE_INT_CAM_A_ST},
	{ISP_IRQ_TYPE_INT_CAM_B_ST},
	{ISP_IRQ_TYPE_INT_DIP_A_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_0_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_1_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_2_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_3_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_4_ST},
	{ISP_IRQ_TYPE_INT_CAMSV_5_ST},
	{ISP_IRQ_TYPE_INT_UNI_A_ST}
};
#endif


#ifdef CONFIG_OF

/* TODO: Remove, Jessy */
typedef enum {
	ISP_BASE_ADDR = 0,
	ISP_INNER_BASE_ADDR,
	ISP_IMGSYS_CONFIG_BASE_ADDR,
	ISP_MIPI_ANA_BASE_ADDR,
	ISP_GPIO_BASE_ADDR,
	ISP_CAM_BASEADDR_NUM
} ISP_CAM_BASEADDR_ENUM;

#ifndef CONFIG_MTK_CLKMGR /*CCF*/
#include <linux/clk.h>
typedef struct {
	struct clk *ISP_SCP_SYS_DIS;
	struct clk *ISP_SCP_SYS_ISP;
	struct clk *ISP_SCP_SYS_CAM;
	struct clk *ISP_MM_SMI_COMMON;
/* ALSK TBD */
	struct clk *ISP_MM_CG2_B12;
	struct clk *ISP_MM_CG1_B12;
	struct clk *ISP_MM_CG1_B13;
	struct clk *ISP_MM_CG1_B14;
	struct clk *ISP_MM_CG1_B15;
	struct clk *ISP_MM_CG1_B16;
	struct clk *ISP_MM_CG1_B17;
	struct clk *ISP_MM_CG1_B9;
	struct clk *ISP_MM_CG1_B10;
	struct clk *ISP_MM_CG0_B0;
	struct clk *ISP_MM_CG2_B13;
	struct clk *ISP_IMG_LARB5;
	struct clk *ISP_IMG_DIP;
	struct clk *ISP_IMG_RSC;
	struct clk *ISP_CAM_LARB;
	struct clk *ISP_CAM_CAMSYS;
	struct clk *ISP_CAM_CAMTG;
	struct clk *ISP_CAM_SENINF;
	struct clk *ISP_CAM_CAMSV0;
	struct clk *ISP_CAM_CAMSV1;
	struct clk *ISP_CAM_CAMSV2;
} ISP_CLK_STRUCT;
ISP_CLK_STRUCT isp_clk;
#endif

/* TODO: Remove, Jessy */
/*static unsigned long gISPSYS_Irq[ISP_IRQ_TYPE_AMOUNT];*/
/*static unsigned long gISPSYS_Reg[ISP_CAM_BASEADDR_NUM];*/

#ifdef CONFIG_OF
struct isp_device {
	void __iomem *regs;
	struct device *dev;
	int irq;
};

static struct isp_device *isp_devs;
static int nr_isp_devs;
#endif

static unsigned int g_TuningBuffer[(ISP_DIP_REG_SIZE >> 2)];
static unsigned int g_TpipeBuffer[(MAX_ISP_TILE_TDR_HEX_NO >> 2)];
static unsigned int g_VirISPBuffer[(ISP_DIP_REG_SIZE >> 2)];
static unsigned int g_CmdqBuffer[(MAX_ISP_CMDQ_BUFFER_SIZE >> 2)];
static unsigned int g_PhyISPBuffer[(ISP_DIP_REG_SIZE >> 2)];
static volatile bool g_bDumpPhyISPBuf = MFALSE;
static ISP_GET_DUMP_INFO_STRUCT g_dumpInfo = {0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF};
static volatile MUINT32 m_CurrentPPB;

#ifdef CONFIG_PM_WAKELOCKS
struct wakeup_source isp_wake_lock;
#else
struct wake_lock isp_wake_lock;
#endif
static volatile int g_bWaitLock;
/*
* static void __iomem *g_isp_base_dase;
* static void __iomem *g_isp_inner_base_dase;
* static void __iomem *g_imgsys_config_base_dase;
*/

/* Get HW modules' base address from device nodes */
#define ISP_CAMSYS_CONFIG_BASE          (isp_devs[ISP_CAMSYS_CONFIG_IDX].regs)
#define ISP_CAM_A_BASE                  (isp_devs[ISP_CAM_A_IDX].regs)
#define ISP_CAM_B_BASE                  (isp_devs[ISP_CAM_B_IDX].regs)
#define ISP_CAMSV0_BASE                 (isp_devs[ISP_CAMSV0_IDX].regs)
#define ISP_CAMSV1_BASE                 (isp_devs[ISP_CAMSV1_IDX].regs)
#define ISP_CAMSV2_BASE                 (isp_devs[ISP_CAMSV2_IDX].regs)
#define ISP_CAMSV3_BASE                 (isp_devs[ISP_CAMSV3_IDX].regs)
#define ISP_CAMSV4_BASE                 (isp_devs[ISP_CAMSV4_IDX].regs)
#define ISP_CAMSV5_BASE                 (isp_devs[ISP_CAMSV5_IDX].regs)
#define ISP_CAM_UNI_BASE                (isp_devs[ISP_CAMTOP_IDX].regs)
#define ISP_IMGSYS_CONFIG_BASE          (isp_devs[ISP_IMGSYS_CONFIG_IDX].regs)
#define ISP_DIP_A_BASE                  (isp_devs[ISP_DIP_A_IDX].regs)

void __iomem *ISP_SENINF0_BASE;
void __iomem *ISP_SENINF1_BASE;
void __iomem *ISP_SENINF2_BASE;
void __iomem *ISP_SENINF3_BASE;

void __iomem *CLOCK_CELL_BASE;

void __iomem *ISP_MMSYS_CONFIG_BASE;

#if (SMI_LARB_MMU_CTL == 1)
void __iomem *SMI_LARB_BASE[8];
#endif


/* TODO: Remove start, Jessy */
#define ISP_ADDR                        (gISPSYS_Reg[ISP_BASE_ADDR])
#define ISP_IMGSYS_BASE                 (gISPSYS_Reg[ISP_IMGSYS_CONFIG_BASE_ADDR])
#define ISP_ADDR_CAMINF                 (gISPSYS_Reg[ISP_IMGSYS_CONFIG_BASE_ADDR])

#define ISP_MIPI_ANA_ADDR               (gISPSYS_Reg[ISP_MIPI_ANA_BASE_ADDR])
#define ISP_GPIO_ADDR                   (gISPSYS_Reg[ISP_GPIO_BASE_ADDR])

#define ISP_IMGSYS_BASE_PHY             0x15000000

#else
#define ISP_ADDR                        (IMGSYS_BASE + 0x4000)
#define ISP_IMGSYS_BASE                 IMGSYS_BASE
#define ISP_ADDR_CAMINF                 IMGSYS_BASE
#define ISP_MIPI_ANA_ADDR               0x10217000
#define ISP_GPIO_ADDR                   GPIO_BASE

#endif
/* TODO: Remove end, Jessy */


#define ISP_REG_SW_CTL_RST_CAM_P1       (1)
#define ISP_REG_SW_CTL_RST_CAM_P2       (2)
#define ISP_REG_SW_CTL_RST_CAMSV        (3)
#define ISP_REG_SW_CTL_RST_CAMSV2       (4)

/** Note: this enum must be exactly the same with that in isp_drv.h
 *  Reg R/W target HW module.
 *  note:
 *  this module support only CAM , CAMSV, and DIP only
 */
typedef enum {
	CAM_A   = 0,
	CAM_B,
	/* CAM_C,        //not supported in everest */
	/* CAM_D,        //not supported in everest */
	CAM_MAX,
	CAMSV_START = CAM_MAX,
	CAMSV_0 = CAMSV_START,
	CAMSV_1,
	CAMSV_2,
	CAMSV_3,
	CAMSV_4,
	CAMSV_5,
	CAMSV_MAX,
	DIP_START = CAMSV_MAX,
	DIP_A = DIP_START,
	/* DIP_B,            //not supported in everest */
	DIP_MAX,
	MAX_ISP_HW_MODULE = DIP_MAX
} ISP_HW_MODULE;

typedef struct {
	MUINT32 sec;
	MUINT32 usec;
} S_START_T;

/* QQ, remove later */
/* record remain node count(success/fail) excludes head when enque/deque control */
static volatile MINT32 EDBufQueRemainNodeCnt;
static volatile MUINT32 g_regScen = 0xa5a5a5a5; /* remove later */


static /*volatile*/ wait_queue_head_t P2WaitQueueHead_WaitDeque;
static /*volatile*/ wait_queue_head_t P2WaitQueueHead_WaitFrame;
static /*volatile*/ wait_queue_head_t P2WaitQueueHead_WaitFrameEQDforDQ;
static spinlock_t      SpinLock_P2FrameList;
#define _MAX_SUPPORT_P2_FRAME_NUM_ 512
#define _MAX_SUPPORT_P2_BURSTQ_NUM_ 8
#define _MAX_SUPPORT_P2_PACKAGE_NUM_ (_MAX_SUPPORT_P2_FRAME_NUM_/_MAX_SUPPORT_P2_BURSTQ_NUM_)
typedef struct {
	volatile MINT32 start; /* starting index for frames in the ring list */
	volatile MINT32 curr; /* current index for running frame in the ring list */
	volatile MINT32 end; /* ending index for frames in the ring list */
} ISP_P2_BUFQUE_IDX_STRUCT;

typedef struct {
	volatile MUINT32               processID;  /* caller process ID */
	volatile MUINT32               callerID;   /* caller thread ID */
	volatile MUINT32               cqMask; /* QQ. optional -> to judge cq combination(for judging frame) */

	volatile ISP_P2_BUF_STATE_ENUM  bufSts;     /* buffer status */
} ISP_P2_FRAME_UNIT_STRUCT;

static volatile ISP_P2_BUFQUE_IDX_STRUCT P2_FrameUnit_List_Idx[ISP_P2_BUFQUE_PROPERTY_NUM];
static volatile ISP_P2_FRAME_UNIT_STRUCT P2_FrameUnit_List[ISP_P2_BUFQUE_PROPERTY_NUM][_MAX_SUPPORT_P2_FRAME_NUM_];

typedef struct {
	volatile MUINT32                processID;  /* caller process ID */
	volatile MUINT32                callerID;   /* caller thread ID */
	volatile MUINT32                dupCQIdx;       /* to judge it belongs to which frame package */
	volatile MINT32                   frameNum;
	volatile MINT32                   dequedNum;  /* number of dequed buffer no matter deque success or fail */
} ISP_P2_FRAME_PACKAGE_STRUCT;
static volatile ISP_P2_BUFQUE_IDX_STRUCT P2_FramePack_List_Idx[ISP_P2_BUFQUE_PROPERTY_NUM];
static volatile ISP_P2_FRAME_PACKAGE_STRUCT
	P2_FramePackage_List[ISP_P2_BUFQUE_PROPERTY_NUM][_MAX_SUPPORT_P2_PACKAGE_NUM_];




static  spinlock_t      SpinLockRegScen;

/* maximum number for supporting user to do interrupt operation */
/* index 0 is for all the user that do not do register irq first */
#define IRQ_USER_NUM_MAX 32
static  spinlock_t      SpinLock_UserKey;



static MINT32 ISP_ResetResume_Cam(ISP_IRQ_TYPE_ENUM module, MUINT32 resume);
#if (TIMESTAMP_QUEUE_EN == 1)
static void ISP_GetDmaPortsStatus(ISP_DEV_NODE_ENUM reg_module, MUINT32 *DmaPortsStats);
static CAM_FrameST Irq_CAM_SttFrameStatus(ISP_DEV_NODE_ENUM module, ISP_IRQ_TYPE_ENUM irq_mod, MUINT32 dma_id,
					MUINT32 delayCheck);
static int32_t ISP_PushBufTimestamp(MUINT32 module, MUINT32 dma_id, MUINT32 sec, MUINT32 usec, MUINT32 frmPeriod);
static int32_t ISP_PopBufTimestamp(MUINT32 module, MUINT32 dma_id, S_START_T *pTstp);
static int32_t ISP_WaitTimestampReady(MUINT32 module, MUINT32 dma_id);
#endif

/*******************************************************************************
*
********************************************************************************/
/* internal data */
/* pointer to the kmalloc'd area, rounded up to a page boundary */
static int *pTbl_RTBuf[ISP_IRQ_TYPE_AMOUNT];
static int Tbl_RTBuf_MMPSize[ISP_IRQ_TYPE_AMOUNT];

/* original pointer for kmalloc'd area as returned by kmalloc */
static void *pBuf_kmalloc[ISP_IRQ_TYPE_AMOUNT];
/*  */
static volatile ISP_RT_BUF_STRUCT * pstRTBuf[ISP_IRQ_TYPE_AMOUNT] = {NULL};

/* static ISP_DEQUE_BUF_INFO_STRUCT g_deque_buf = {0,{}};    // Marked to remove build warning. */

unsigned long g_Flash_SpinLock;


static volatile unsigned int G_u4EnableClockCount;

int pr_detect_count;

/*save ion fd*/
#define ENABLE_KEEP_ION_HANDLE

#ifdef ENABLE_KEEP_ION_HANDLE
#define _ion_keep_max_   (64)/*32*/
#include "ion_drv.h" /*g_ion_device*/
static struct ion_client *pIon_client;
static MINT32 G_WRDMA_IonCt[CAM_MAX][_dma_max_wr_][_ion_keep_max_] = { { {0} } };
static MINT32 G_WRDMA_IonFd[CAM_MAX][_dma_max_wr_][_ion_keep_max_] = { { {0} } };
static struct ion_handle *G_WRDMA_IonHnd[CAM_MAX][_dma_max_wr_][_ion_keep_max_] = { { {NULL} } };
static spinlock_t SpinLock_IonHnd[CAM_MAX][_dma_max_wr_]; /* protect G_WRDMA_IonHnd & G_WRDMA_IonFd */
#endif
/*******************************************************************************
*
********************************************************************************/
typedef struct {
	pid_t   Pid;
	pid_t   Tid;
} ISP_USER_INFO_STRUCT;

/*******************************************************************************
*
********************************************************************************/
#define ISP_BUF_SIZE            (4096)
#define ISP_BUF_SIZE_WRITE      1024
#define ISP_BUF_WRITE_AMOUNT    6

typedef enum {
	ISP_BUF_STATUS_EMPTY,
	ISP_BUF_STATUS_HOLD,
	ISP_BUF_STATUS_READY
} ISP_BUF_STATUS_ENUM;

typedef struct {
	volatile ISP_BUF_STATUS_ENUM Status;
	volatile MUINT32                Size;
	MUINT8 *pData;
} ISP_BUF_STRUCT;

typedef struct {
	ISP_BUF_STRUCT      Read;
	ISP_BUF_STRUCT      Write[ISP_BUF_WRITE_AMOUNT];
} ISP_BUF_INFO_STRUCT;


/*******************************************************************************
*
********************************************************************************/
#define ISP_ISR_MAX_NUM 32
#define INT_ERR_WARN_TIMER_THREAS 1000
#define INT_ERR_WARN_MAX_TIME 1

typedef struct {
	MUINT32 m_err_int_cnt[ISP_IRQ_TYPE_AMOUNT][ISP_ISR_MAX_NUM]; /* cnt for each err int # */
	MUINT32 m_warn_int_cnt[ISP_IRQ_TYPE_AMOUNT][ISP_ISR_MAX_NUM]; /* cnt for each warning int # */
	MUINT32 m_err_int_mark[ISP_IRQ_TYPE_AMOUNT]; /* mark for err int, where its cnt > threshold */
	MUINT32 m_warn_int_mark[ISP_IRQ_TYPE_AMOUNT]; /* mark for warn int, where its cnt > threshold */
	unsigned long m_int_usec[ISP_IRQ_TYPE_AMOUNT];
} ISP_IRQ_ERR_WAN_CNT_STRUCT;

static volatile MINT32 FirstUnusedIrqUserKey = 1;
#define USERKEY_STR_LEN 128

typedef struct {
	char userName[USERKEY_STR_LEN]; /* name for the user that register a userKey */
	int userKey;    /* the user key for that user */
} UserKeyInfo;
/* array for recording the user name for a specific user key */
static volatile UserKeyInfo IrqUserKey_UserInfo[IRQ_USER_NUM_MAX];

typedef struct {
	/* Add an extra index for status type in Everest -> signal or dma */
	volatile MUINT32    Status[ISP_IRQ_TYPE_AMOUNT][ISP_IRQ_ST_AMOUNT][IRQ_USER_NUM_MAX];
	MUINT32             Mask[ISP_IRQ_TYPE_AMOUNT][ISP_IRQ_ST_AMOUNT];
	MUINT32             ErrMask[ISP_IRQ_TYPE_AMOUNT][ISP_IRQ_ST_AMOUNT];
	UINT32              WarnMask[ISP_IRQ_TYPE_AMOUNT][ISP_IRQ_ST_AMOUNT];
	/* flag for indicating that user do mark for a interrupt or not */
	volatile MUINT32    MarkedFlag[ISP_IRQ_TYPE_AMOUNT][ISP_IRQ_ST_AMOUNT][IRQ_USER_NUM_MAX];
	/* time for marking a specific interrupt */
	volatile MUINT32    MarkedTime_sec[ISP_IRQ_TYPE_AMOUNT][32][IRQ_USER_NUM_MAX];
	/* time for marking a specific interrupt */
	volatile MUINT32    MarkedTime_usec[ISP_IRQ_TYPE_AMOUNT][32][IRQ_USER_NUM_MAX];
	/* number of a specific signal that passed by */
	volatile MINT32     PassedBySigCnt[ISP_IRQ_TYPE_AMOUNT][32][IRQ_USER_NUM_MAX];
	/* */
	volatile MUINT32    LastestSigTime_sec[ISP_IRQ_TYPE_AMOUNT][32];
	/* latest time for each interrupt */
	volatile MUINT32    LastestSigTime_usec[ISP_IRQ_TYPE_AMOUNT][32];
	/* latest time for each interrupt */
} ISP_IRQ_INFO_STRUCT;

typedef struct {
	MUINT32     Vd;
	MUINT32     Expdone;
	MUINT32     WorkQueueVd;
	MUINT32     WorkQueueExpdone;
	MUINT32     TaskletVd;
	MUINT32     TaskletExpdone;
} ISP_TIME_LOG_STRUCT;

#if (TIMESTAMP_QUEUE_EN == 1)
#define ISP_TIMESTPQ_DEPTH      (256)
typedef struct {
	struct {
		S_START_T   TimeQue[ISP_TIMESTPQ_DEPTH];
		MUINT32     WrIndex; /* increase when p1done or dmao done */
		MUINT32     RdIndex; /* increase when user deque */
		volatile unsigned long long  TotalWrCnt;
		volatile unsigned long long  TotalRdCnt;
		/* TSTP_V3 MUINT32	    PrevFbcDropCnt; */
		MUINT32     PrevFbcWCnt;
	} Dmao[_cam_max_];
	MUINT32  DmaEnStatus[_cam_max_];
} ISP_TIMESTPQ_INFO_STRUCT;
#endif

typedef enum _eChannel {
	_PASS1      = 0,
	_PASS1_D    = 1,
	_CAMSV      = 2,
	_CAMSV_D    = 3,
	_PASS2      = 4,
	_ChannelMax = 5,
} eChannel;



/**********************************************************************/
#define my_get_pow_idx(value)      \
	({                                                          \
		int i = 0, cnt = 0;                                  \
		for (i = 0; i < 32; i++) {                            \
			if ((value>>i) & (0x00000001)) {   \
				break;                                      \
			} else {                                            \
				cnt++;  \
			}                                      \
		}                                                    \
		cnt;                                                \
	})


static volatile UINT32 g_ISPIntErr[ISP_IRQ_TYPE_AMOUNT] = {0};
static volatile MUINT32 g_DmaErr_CAM[ISP_IRQ_TYPE_AMOUNT][_cam_max_] = {{0} };



#define SUPPORT_MAX_IRQ 32
typedef struct {
	spinlock_t                      SpinLockIspRef;
	spinlock_t                      SpinLockIsp;
	spinlock_t                      SpinLockIrq[ISP_IRQ_TYPE_AMOUNT];
	spinlock_t                      SpinLockIrqCnt[ISP_IRQ_TYPE_AMOUNT];
	spinlock_t                      SpinLockRTBC;
	spinlock_t                      SpinLockClock;
	wait_queue_head_t               WaitQueueHead[ISP_IRQ_TYPE_AMOUNT];
	/* wait_queue_head_t*              WaitQHeadList; */
	volatile wait_queue_head_t      WaitQHeadList[SUPPORT_MAX_IRQ];
	MUINT32                         UserCount;
	MUINT32                         DebugMask;
	MINT32							IrqNum;
	ISP_IRQ_INFO_STRUCT			IrqInfo;
	ISP_IRQ_ERR_WAN_CNT_STRUCT		IrqCntInfo;
	ISP_BUF_INFO_STRUCT			BufInfo;
	ISP_TIME_LOG_STRUCT             TimeLog;
	#if (TIMESTAMP_QUEUE_EN == 1)
	ISP_TIMESTPQ_INFO_STRUCT        TstpQInfo[ISP_IRQ_TYPE_AMOUNT];
	#endif
} ISP_INFO_STRUCT;



static ISP_INFO_STRUCT IspInfo;
static MBOOL    SuspnedRecord[ISP_DEV_NODE_NUM] = {0};

typedef enum _eLOG_TYPE {
	_LOG_DBG = 0,   /* currently, only used at ipl_buf_ctrl. to protect critical section */
	_LOG_INF = 1,
	_LOG_ERR = 2,
	_LOG_MAX = 3,
} eLOG_TYPE;

typedef enum _eLOG_OP {
	_LOG_INIT = 0,
	_LOG_RST = 1,
	_LOG_ADD = 2,
	_LOG_PRT = 3,
	_LOG_GETCNT = 4,
	_LOG_OP_MAX = 5
} eLOG_OP;

#define NORMAL_STR_LEN (512)
#define ERR_PAGE 2
#define DBG_PAGE 2
#define INF_PAGE 4
/* #define SV_LOG_STR_LEN NORMAL_STR_LEN */

#define LOG_PPNUM 2
typedef struct _SV_LOG_STR {
	MUINT32 _cnt[LOG_PPNUM][_LOG_MAX];
	/* char   _str[_LOG_MAX][SV_LOG_STR_LEN]; */
	char *_str[LOG_PPNUM][_LOG_MAX];
	S_START_T   _lastIrqTime;
} SV_LOG_STR, *PSV_LOG_STR;

static void *pLog_kmalloc;
static SV_LOG_STR gSvLog[ISP_IRQ_TYPE_AMOUNT];

/**
 *   for irq used,keep log until IRQ_LOG_PRINTER being involked,
 *   limited:
 *   each log must shorter than 512 bytes
 *   total log length in each irq/logtype can't over 1024 bytes
 */
#define IRQ_LOG_KEEPER_T(sec, usec) {\
		ktime_t time;           \
		time = ktime_get();     \
		sec = time.tv64;        \
		do_div(sec, 1000);    \
		usec = do_div(sec, 1000000);\
	}
#if 1
#define IRQ_LOG_KEEPER(irq, ppb, logT, fmt, ...) do {\
	char *ptr; \
	char *pDes;\
	MINT32 avaLen;\
	MUINT32 *ptr2 = &gSvLog[irq]._cnt[ppb][logT];\
	unsigned int str_leng;\
	MUINT32 i;\
	SV_LOG_STR *pSrc = &gSvLog[irq];\
	if (logT == _LOG_ERR) {\
		str_leng = NORMAL_STR_LEN*ERR_PAGE; \
	} else if (logT == _LOG_DBG) {\
		str_leng = NORMAL_STR_LEN*DBG_PAGE; \
	} else if (logT == _LOG_INF) {\
		str_leng = NORMAL_STR_LEN*INF_PAGE;\
	} else {\
		str_leng = 0;\
	} \
	ptr = pDes = (char *)&(gSvLog[irq]._str[ppb][logT][gSvLog[irq]._cnt[ppb][logT]]);    \
	avaLen = str_leng - 1 - gSvLog[irq]._cnt[ppb][logT];\
	if (avaLen > 1) {\
		snprintf((char *)(pDes), avaLen, "[%d.%06d]" fmt,\
			gSvLog[irq]._lastIrqTime.sec, gSvLog[irq]._lastIrqTime.usec,\
			##__VA_ARGS__);   \
		if ('\0' != gSvLog[irq]._str[ppb][logT][str_leng - 1]) {\
			LOG_ERR("log str over flow(%d)", irq);\
		} \
		while (*ptr++ != '\0') {        \
			(*ptr2)++;\
		}     \
	} else { \
		LOG_INF("(%d)(%d)log str avalible=0, print log\n", irq, logT);\
		ptr = pSrc->_str[ppb][logT];\
		if (pSrc->_cnt[ppb][logT] != 0) {\
			if (logT == _LOG_DBG) {\
				for (i = 0; i < DBG_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_DBG("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_DBG("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else if (logT == _LOG_INF) {\
				for (i = 0; i < INF_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_INF("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_INF("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else if (logT == _LOG_ERR) {\
				for (i = 0; i < ERR_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_ERR("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_ERR("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else {\
				LOG_ERR("N.S.%d", logT);\
			} \
			ptr[0] = '\0';\
			pSrc->_cnt[ppb][logT] = 0;\
			avaLen = str_leng - 1;\
			ptr = pDes = (char *)&(pSrc->_str[ppb][logT][pSrc->_cnt[ppb][logT]]);\
			ptr2 = &(pSrc->_cnt[ppb][logT]);\
			snprintf((char *)(pDes), avaLen, fmt, ##__VA_ARGS__);   \
			while (*ptr++ != '\0') {\
				(*ptr2)++;\
			} \
		} \
	} \
} while (0)
#else
#define IRQ_LOG_KEEPER(irq, ppb, logT, fmt, args...)    pr_warn(IRQTag fmt,  ##args)
#endif

#if 1
#define IRQ_LOG_PRINTER(irq, ppb_in, logT_in) do {\
		SV_LOG_STR *pSrc = &gSvLog[irq];\
		char *ptr;\
		MUINT32 i;\
		MINT32 ppb = 0;\
		MINT32 logT = 0;\
		if (ppb_in > 1) {\
			ppb = 1;\
		} else{\
			ppb = ppb_in;\
		} \
		if (logT_in > _LOG_ERR) {\
			logT = _LOG_ERR;\
		} else{\
			logT = logT_in;\
		} \
		ptr = pSrc->_str[ppb][logT];\
		if (pSrc->_cnt[ppb][logT] != 0) {\
			if (logT == _LOG_DBG) {\
				for (i = 0; i < DBG_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_DBG("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_DBG("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else if (logT == _LOG_INF) {\
				for (i = 0; i < INF_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_INF("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_INF("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else if (logT == _LOG_ERR) {\
				for (i = 0; i < ERR_PAGE; i++) {\
					if (ptr[NORMAL_STR_LEN*(i+1) - 1] != '\0') {\
						ptr[NORMAL_STR_LEN*(i+1) - 1] = '\0';\
						LOG_ERR("%s", &ptr[NORMAL_STR_LEN*i]);\
					} else{\
						LOG_ERR("%s", &ptr[NORMAL_STR_LEN*i]);\
						break;\
					} \
				} \
			} \
			else {\
				LOG_ERR("N.S.%d", logT);\
			} \
			ptr[0] = '\0';\
			pSrc->_cnt[ppb][logT] = 0;\
		} \
	} while (0)


#else
#define IRQ_LOG_PRINTER(irq, ppb, logT)
#endif

/* //////////////////////////////////////////////////// */
typedef volatile union _FBC_CTRL_1_ {
	volatile struct { /* 0x18004110 */
		unsigned int  FBC_NUM                               :  6;      /*  0.. 5, 0x0000003F */
		unsigned int  rsv_6                                 :  9;      /*  6..14, 0x00007FC0 */
		unsigned int  FBC_EN                                :  1;      /* 15..15, 0x00008000 */
		unsigned int  FBC_MODE                              :  1;      /* 16..16, 0x00010000 */
		unsigned int  LOCK_EN                               :  1;      /* 17..17, 0x00020000 */
		unsigned int  rsv_18                                :  2;      /* 18..19, 0x000C0000 */
		unsigned int  DROP_TIMING                           :  1;      /* 20..20, 0x00100000 */
		unsigned int  rsv_21                                :  3;      /* 21..23, 0x00E00000 */
		unsigned int  SUB_RATIO                             :  8;      /* 24..31, 0xFF000000 */
	} Bits;
	UINT32 Raw;
} FBC_CTRL_1;  /* CAM_A_FBC_IMGO_CTL1 */

typedef volatile union _FBC_CTRL_2_ {
	volatile struct { /* 0x18004114 */
		unsigned int  FBC_CNT                               :  7;      /*  0.. 6, 0x0000007F */
		unsigned int  rsv_7                                 :  1;      /*  7.. 7, 0x00000080 */
		unsigned int  RCNT                                  :  6;      /*  8..13, 0x00003F00 */
		unsigned int  rsv_14                                :  2;      /* 14..15, 0x0000C000 */
		unsigned int  WCNT                                  :  6;      /* 16..21, 0x003F0000 */
		unsigned int  rsv_22                                :  2;      /* 22..23, 0x00C00000 */
		unsigned int  DROP_CNT                              :  8;      /* 24..31, 0xFF000000 */
	} Bits;
	UINT32 Raw;
} FBC_CTRL_2;  /* CAM_A_FBC_IMGO_CTL2 */


#ifdef ISP_Recovery


#define CONSST_FBC_CNT_INIT 1



/* extern void mt_irq_dump_status(int irq); */
static volatile MINT32 bResumeSignal;

typedef struct _isp_backup_reg {
	UINT32               CAM_CTL_START;                  /* 4000 */
	UINT32               CAM_CTL_EN_P1;                  /* 4004 */
	UINT32           CAM_CTL_EN_P1_DMA;                  /* 4008 */
	UINT32                    rsv_400C;                  /* 400C */
	UINT32             CAM_CTL_EN_P1_D;                  /* 4010 */
	UINT32         CAM_CTL_EN_P1_DMA_D;                  /* 4014 */
	UINT32               CAM_CTL_EN_P2;                  /* 4018 */
	UINT32           CAM_CTL_EN_P2_DMA;                  /* 401C */
	UINT32               CAM_CTL_CQ_EN;                  /* 4020 */
	UINT32            CAM_CTL_SCENARIO;                  /* 4024 */
	UINT32          CAM_CTL_FMT_SEL_P1;                  /* 4028 */
	UINT32        CAM_CTL_FMT_SEL_P1_D;                  /* 402C */
	UINT32          CAM_CTL_FMT_SEL_P2;                  /* 4030 */
	UINT32              CAM_CTL_SEL_P1;                  /* 4034 */
	UINT32            CAM_CTL_SEL_P1_D;                  /* 4038 */
	UINT32              CAM_CTL_SEL_P2;                  /* 403C */
	UINT32          CAM_CTL_SEL_GLOBAL;                  /* 4040 */
	UINT32                    rsv_4044;                  /* 4044 */
	UINT32           CAM_CTL_INT_P1_EN;                  /* 4048 */
	UINT32       CAM_CTL_INT_P1_STATUS;                  /* 404C */
	UINT32          CAM_CTL_INT_P1_EN2;                  /* 4050 */
	UINT32      CAM_CTL_INT_P1_STATUS2;                  /* 4054 */
	UINT32         CAM_CTL_INT_P1_EN_D;                  /* 4058 */
	UINT32     CAM_CTL_INT_P1_STATUS_D;                  /* 405C */
	UINT32        CAM_CTL_INT_P1_EN2_D;                  /* 4060 */
	UINT32    CAM_CTL_INT_P1_STATUS2_D;                  /* 4064 */
	UINT32           CAM_CTL_INT_P2_EN;                  /* 4068 */
	UINT32       CAM_CTL_INT_P2_STATUS;                  /* 406C */
	UINT32         CAM_CTL_INT_STATUSX;                  /* 4070 */
	UINT32        CAM_CTL_INT_STATUS2X;                  /* 4074 */
	UINT32        CAM_CTL_INT_STATUS3X;                  /* 4078 */
	UINT32                CAM_CTL_TILE;                  /* 407C */
	UINT32       CAM_CTL_TDR_EN_STATUS;                  /* 4080 */
	UINT32              CAM_CTL_TCM_EN;                  /* 4084 */
	UINT32      CAM_CTL_TDR_DBG_STATUS;                  /* 4088 */
	UINT32              CAM_CTL_SW_CTL;                  /* 408C */
	UINT32              CAM_CTL_SPARE0;                  /* 4090 */
	UINT32               CAM_RRZ_OUT_W;                 /* 4094 */
	UINT32                    rsv_4098;                 /* 4098 */
	UINT32              CAM_RRZ_OUT_W_D;                /* 409C */
	UINT32        CAM_CTL_CQ1_BASEADDR;                 /* 40A0 */
	UINT32        CAM_CTL_CQ2_BASEADDR;                 /* 40A4 */
	UINT32        CAM_CTL_CQ3_BASEADDR;                 /* 40A8 */
	UINT32        CAM_CTL_CQ0_BASEADDR;                 /* 40AC */
	UINT32       CAM_CTL_CQ0B_BASEADDR;                 /* 40B0 */
	UINT32       CAM_CTL_CQ0C_BASEADDR;                 /* 40B4 */
	UINT32    CAM_CTL_CUR_CQ0_BASEADDR;                 /* 40B8 */
	UINT32   CAM_CTL_CUR_CQ0B_BASEADDR;                 /* 40BC */
	UINT32   CAM_CTL_CUR_CQ0C_BASEADDR;                 /* 40C0 */
	UINT32      CAM_CTL_CQ0_D_BASEADDR;                 /* 40C4 */
	UINT32     CAM_CTL_CQ0B_D_BASEADDR;                 /* 40C8 */
	UINT32     CAM_CTL_CQ0C_D_BASEADDR;                 /* 40CC */
	UINT32  CAM_CTL_CUR_CQ0_D_BASEADDR;                 /* 40D0 */
	UINT32 CAM_CTL_CUR_CQ0B_D_BASEADDR;                 /* 40D4 */
	UINT32 CAM_CTL_CUR_CQ0C_D_BASEADDR;                 /* 40D8 */
	UINT32           CAM_CTL_DB_LOAD_D;                 /* 40DC */
	UINT32             CAM_CTL_DB_LOAD;                 /* 40E0 */
	UINT32         CAM_CTL_P1_DONE_BYP;                 /* 40E4 */
	UINT32       CAM_CTL_P1_DONE_BYP_D;                 /* 40E8 */
	UINT32         CAM_CTL_P2_DONE_BYP;                 /* 40EC */
	UINT32            CAM_CTL_IMGO_FBC;                 /* 40F0 */
	UINT32            CAM_CTL_RRZO_FBC;                 /* 40F4 */
	UINT32          CAM_CTL_IMGO_D_FBC;                 /* 40F8 */
	UINT32          CAM_CTL_RRZO_D_FBC;                 /* 40FC */



	UINT32                CAM_CTL_IHDR;                 /* 4104 */
	UINT32              CAM_CTL_IHDR_D;                 /* 4108 */
	UINT32            CAM_CTL_CQ_EN_P2;                 /* 410C */

	UINT32              CAM_CTL_CLK_EN;                 /* 4170 */
	UINT32             CAM_TG_SEN_MODE;                 /* 4410 */
	UINT32               CAM_TG_VF_CON;                 /* 4414 */
	UINT32         CAM_TG_SEN_GRAB_PXL;                 /* 4418 */
	UINT32         CAM_TG_SEN_GRAB_LIN;                 /* 441C */
	UINT32             CAM_TG_PATH_CFG;                 /* 4420 */
	UINT32            CAM_TG_MEMIN_CTL;                 /* 4424 */


	UINT32              CAM_OBC_OFFST0;                 /* 4500 */
	UINT32              CAM_OBC_OFFST1;                 /* 4504 */
	UINT32              CAM_OBC_OFFST2;                 /* 4508 */
	UINT32              CAM_OBC_OFFST3;                 /* 450C */
	UINT32               CAM_OBC_GAIN0;                 /* 4510 */
	UINT32               CAM_OBC_GAIN1;                 /* 4514 */
	UINT32               CAM_OBC_GAIN2;                 /* 4518 */
	UINT32               CAM_OBC_GAIN3;                 /* 451C */
	UINT32                 rsv_4520[4];                 /* 4520...452C */
	UINT32                CAM_LSC_CTL1;                 /* 4530 */
	UINT32                CAM_LSC_CTL2;                 /* 4534 */
	UINT32                CAM_LSC_CTL3;                 /* 4538 */
	UINT32              CAM_LSC_LBLOCK;                 /* 453C */
	UINT32               CAM_LSC_RATIO;                 /* 4540 */
	UINT32          CAM_LSC_TPIPE_OFST;                 /* 4544 */
	UINT32          CAM_LSC_TPIPE_SIZE;                 /* 4548 */
	UINT32             CAM_LSC_GAIN_TH;                 /* 454C */
	UINT32              CAM_RPG_SATU_1;                 /* 4550 */
	UINT32              CAM_RPG_SATU_2;                 /* 4554 */
	UINT32              CAM_RPG_GAIN_1;                 /* 4558 */
	UINT32              CAM_RPG_GAIN_2;                 /* 455C */
	UINT32              CAM_RPG_OFST_1;                 /* 4560 */
	UINT32              CAM_RPG_OFST_2;                 /* 4564 */
	UINT32                rsv_4568[6];                  /* 4568...457C */
	UINT32                CAM_SGG2_PGN;                 /* 4580 */
	UINT32             CAM_SGG2_GMRC_1;                 /* 4584 */
	UINT32             CAM_SGG2_GMRC_2;                 /* 4588 */
	UINT32                 rsv_458C[9];                 /* 458C...45AC */
	UINT32             CAM_AWB_WIN_ORG;                 /* 45B0 */
	UINT32            CAM_AWB_WIN_SIZE;                 /* 45B4 */
	UINT32             CAM_AWB_WIN_PIT;                 /* 45B8 */
	UINT32             CAM_AWB_WIN_NUM;                 /* 45BC */
	UINT32             CAM_AWB_GAIN1_0;                 /* 45C0 */
	UINT32             CAM_AWB_GAIN1_1;                 /* 45C4 */
	UINT32              CAM_AWB_LMT1_0;                 /* 45C8 */
	UINT32              CAM_AWB_LMT1_1;                 /* 45CC */
	UINT32             CAM_AWB_LOW_THR;                 /* 45D0 */
	UINT32              CAM_AWB_HI_THR;                 /* 45D4 */
	UINT32          CAM_AWB_PIXEL_CNT0;                 /* 45D8 */
	UINT32          CAM_AWB_PIXEL_CNT1;                 /* 45DC */
	UINT32          CAM_AWB_PIXEL_CNT2;                 /* 45E0 */
	UINT32             CAM_AWB_ERR_THR;                 /* 45E4 */
	UINT32                 CAM_AWB_ROT;                 /* 45E8 */
	UINT32                CAM_AWB_L0_X;                 /* 45EC */
	UINT32                CAM_AWB_L0_Y;                 /* 45F0 */
	UINT32                CAM_AWB_L1_X;                 /* 45F4 */
	UINT32                CAM_AWB_L1_Y;                 /* 45F8 */
	UINT32                CAM_AWB_L2_X;                 /* 45FC */
	UINT32                CAM_AWB_L2_Y;                 /* 4600 */
	UINT32                CAM_AWB_L3_X;                 /* 4604 */
	UINT32                CAM_AWB_L3_Y;                 /* 4608 */
	UINT32                CAM_AWB_L4_X;                 /* 460C */
	UINT32                CAM_AWB_L4_Y;                 /* 4610 */
	UINT32                CAM_AWB_L5_X;                 /* 4614 */
	UINT32                CAM_AWB_L5_Y;                 /* 4618 */
	UINT32                CAM_AWB_L6_X;                 /* 461C */
	UINT32                CAM_AWB_L6_Y;                 /* 4620 */
	UINT32                CAM_AWB_L7_X;                 /* 4624 */
	UINT32                CAM_AWB_L7_Y;                 /* 4628 */
	UINT32                CAM_AWB_L8_X;                 /* 462C */
	UINT32                CAM_AWB_L8_Y;                 /* 4630 */
	UINT32                CAM_AWB_L9_X;                 /* 4634 */
	UINT32                CAM_AWB_L9_Y;                 /* 4638 */
	UINT32               CAM_AWB_SPARE;                 /* 463C */
	UINT32                 rsv_4640[4];                 /* 4640...464C */
	UINT32              CAM_AE_HST_CTL;                 /* 4650 */
	UINT32              CAM_AE_GAIN2_0;                 /* 4654 */
	UINT32              CAM_AE_GAIN2_1;                 /* 4658 */
	UINT32               CAM_AE_LMT2_0;                 /* 465C */
	UINT32               CAM_AE_LMT2_1;                 /* 4660 */
	UINT32             CAM_AE_RC_CNV_0;                 /* 4664 */
	UINT32             CAM_AE_RC_CNV_1;                 /* 4668 */
	UINT32             CAM_AE_RC_CNV_2;                 /* 466C */
	UINT32             CAM_AE_RC_CNV_3;                 /* 4670 */
	UINT32             CAM_AE_RC_CNV_4;                 /* 4674 */
	UINT32             CAM_AE_YGAMMA_0;                 /* 4678 */
	UINT32             CAM_AE_YGAMMA_1;                 /* 467C */
	UINT32              CAM_AE_HST_SET;                 /* 4680 */
	UINT32             CAM_AE_HST0_RNG;                 /* 4684 */
	UINT32             CAM_AE_HST1_RNG;                 /* 4688 */
	UINT32             CAM_AE_HST2_RNG;                 /* 468C */
	UINT32             CAM_AE_HST3_RNG;                 /* 4690 */
	UINT32                CAM_AE_SPARE;                 /* 4694 */
	UINT32                 rsv_4698[2];                 /* 4698...469C */
	UINT32                CAM_SGG1_PGN;                 /* 46A0 */
	UINT32             CAM_SGG1_GMRC_1;                 /* 46A4 */
	UINT32             CAM_SGG1_GMRC_2;                 /* 46A8 */
	UINT32                    rsv_46AC;                 /* 46AC */
	UINT32                  CAM_AF_CON;                 /* 46B0 */
	UINT32               CAM_AF_WINX_1;                 /* 46B4 */
	UINT32               CAM_AF_WINX_2;                 /* 46B8 */
	UINT32               CAM_AF_WINX_3;                 /* 46BC */
	UINT32               CAM_AF_WINY_1;                 /* 46C0 */
	UINT32               CAM_AF_WINY_2;                 /* 46C4 */
	UINT32               CAM_AF_WINY_3;                 /* 46C8 */
	UINT32                 CAM_AF_SIZE;                 /* 46CC */
	UINT32                    rsv_46D0;                 /* 46D0 */
	UINT32                CAM_AF_FLT_1;                 /* 46D4 */
	UINT32                CAM_AF_FLT_2;                 /* 46D8 */
	UINT32                CAM_AF_FLT_3;                 /* 46DC */
	UINT32                   CAM_AF_TH;                 /* 46E0 */
	UINT32            CAM_AF_FLO_WIN_1;                 /* 46E4 */
	UINT32           CAM_AF_FLO_SIZE_1;                 /* 46E8 */
	UINT32            CAM_AF_FLO_WIN_2;                 /* 46EC */
	UINT32           CAM_AF_FLO_SIZE_2;                 /* 46F0 */
	UINT32            CAM_AF_FLO_WIN_3;                 /* 46F4 */
	UINT32           CAM_AF_FLO_SIZE_3;                 /* 46F8 */
	UINT32               CAM_AF_FLO_TH;                 /* 46FC */
	UINT32           CAM_AF_IMAGE_SIZE;                 /* 4700 */
	UINT32                CAM_AF_FLT_4;                 /* 4704 */
	UINT32                CAM_AF_FLT_5;                 /* 4708 */
	UINT32               CAM_AF_STAT_L;                 /* 470C */
	UINT32               CAM_AF_STAT_M;                 /* 4710 */
	UINT32          CAM_AF_FLO_STAT_1L;                 /* 4714 */
	UINT32          CAM_AF_FLO_STAT_1M;                 /* 4718 */
	UINT32          CAM_AF_FLO_STAT_1V;                 /* 471C */
	UINT32          CAM_AF_FLO_STAT_2L;                 /* 4720 */
	UINT32          CAM_AF_FLO_STAT_2M;                 /* 4724 */
	UINT32          CAM_AF_FLO_STAT_2V;                 /* 4728 */
	UINT32          CAM_AF_FLO_STAT_3L;                 /* 472C */
	UINT32          CAM_AF_FLO_STAT_3M;                 /* 4730 */
	UINT32          CAM_AF_FLO_STAT_3V;                 /* 4734 */
	UINT32                rsv_4738[10];                 /* 4738...475C */
	UINT32                CAM_WBN_SIZE;                 /* 4760 */
	UINT32                CAM_WBN_MODE;                 /* 4764 */
	UINT32                 rsv_4768[2];                 /* 4768...476C */
	UINT32                 CAM_FLK_CON;                 /* 4770 */
	UINT32                CAM_FLK_OFST;                 /* 4774 */
	UINT32                CAM_FLK_SIZE;                 /* 4778 */
	UINT32                 CAM_FLK_NUM;                 /* 477C */
	UINT32                 CAM_LCS_CON;                 /* 4780 */
	UINT32                  CAM_LCS_ST;                 /* 4784 */
	UINT32                 CAM_LCS_AWS;                 /* 4788 */
	UINT32                 CAM_LCS_FLR;                 /* 478C */
	UINT32              CAM_LCS_LRZR_1;                 /* 4790 */
	UINT32              CAM_LCS_LRZR_2;                 /* 4794 */
	UINT32                 rsv_4798[2];                 /* 4798...479C */
	UINT32                 CAM_RRZ_CTL;                 /* 47A0 */
	UINT32              CAM_RRZ_IN_IMG;                 /* 47A4 */
	UINT32             CAM_RRZ_OUT_IMG;                 /* 47A8 */
	UINT32           CAM_RRZ_HORI_STEP;                 /* 47AC */
	UINT32           CAM_RRZ_VERT_STEP;                 /* 47B0 */
	UINT32       CAM_RRZ_HORI_INT_OFST;                 /* 47B4 */
	UINT32       CAM_RRZ_HORI_SUB_OFST;                 /* 47B8 */
	UINT32       CAM_RRZ_VERT_INT_OFST;                 /* 47BC */
	UINT32       CAM_RRZ_VERT_SUB_OFST;                 /* 47C0 */
	UINT32             CAM_RRZ_MODE_TH;                 /* 47C4 */
	UINT32            CAM_RRZ_MODE_CTL;                 /* 47C8 */
	UINT32                rsv_47CC[13];                 /* 47CC...47FC */
	UINT32                 CAM_BPC_CON;                 /* 4800 */
	UINT32                 CAM_BPC_TH1;                 /* 4804 */
	UINT32                 CAM_BPC_TH2;                 /* 4808 */
	UINT32                 CAM_BPC_TH3;                 /* 480C */
	UINT32                 CAM_BPC_TH4;                 /* 4810 */
	UINT32                 CAM_BPC_DTC;                 /* 4814 */
	UINT32                 CAM_BPC_COR;                 /* 4818 */
	UINT32               CAM_BPC_TBLI1;                 /* 481C */
	UINT32               CAM_BPC_TBLI2;                 /* 4820 */
	UINT32               CAM_BPC_TH1_C;                 /* 4824 */
	UINT32               CAM_BPC_TH2_C;                 /* 4828 */
	UINT32               CAM_BPC_TH3_C;                 /* 482C */
	UINT32                CAM_BPC_RMM1;                 /* 4830 */
	UINT32                CAM_BPC_RMM2;                 /* 4834 */
	UINT32          CAM_BPC_RMM_REVG_1;                 /* 4838 */
	UINT32          CAM_BPC_RMM_REVG_2;                 /* 483C */
	UINT32            CAM_BPC_RMM_LEOS;                 /* 4840 */
	UINT32            CAM_BPC_RMM_GCNT;                 /* 4844 */
	UINT32                 rsv_4848[2];                 /* 4848...484C */
	UINT32                 CAM_NR1_CON;                 /* 4850 */
	UINT32              CAM_NR1_CT_CON;                 /* 4854 */
	UINT32                CAM_BNR_RSV1;                 /* 4858 */
	UINT32                CAM_BNR_RSV2;                 /* 485C */
	UINT32                 rsv_4860[8];                 /* 4860...487C */
	UINT32              CAM_PGN_SATU_1;                 /* 4880 */
	UINT32              CAM_PGN_SATU_2;                 /* 4884 */
	UINT32              CAM_PGN_GAIN_1;                 /* 4888 */
	UINT32              CAM_PGN_GAIN_2;                 /* 488C */
	UINT32              CAM_PGN_OFST_1;                 /* 4890 */
	UINT32              CAM_PGN_OFST_2;                 /* 4894 */
	UINT32                 rsv_4898[2];                 /* 4898...489C */
	UINT32                CAM_DM_O_BYP;                 /* 48A0 */
	UINT32            CAM_DM_O_ED_FLAT;                 /* 48A4 */
	UINT32             CAM_DM_O_ED_NYQ;                 /* 48A8 */
	UINT32            CAM_DM_O_ED_STEP;                 /* 48AC */
	UINT32             CAM_DM_O_RGB_HF;                 /* 48B0 */
	UINT32                CAM_DM_O_DOT;                 /* 48B4 */
	UINT32             CAM_DM_O_F1_ACT;                 /* 48B8 */
	UINT32             CAM_DM_O_F2_ACT;                 /* 48BC */
	UINT32             CAM_DM_O_F3_ACT;                 /* 48C0 */
	UINT32             CAM_DM_O_F4_ACT;                 /* 48C4 */
	UINT32               CAM_DM_O_F1_L;                 /* 48C8 */
	UINT32               CAM_DM_O_F2_L;                 /* 48CC */
	UINT32               CAM_DM_O_F3_L;                 /* 48D0 */
	UINT32               CAM_DM_O_F4_L;                 /* 48D4 */
	UINT32              CAM_DM_O_HF_RB;                 /* 48D8 */
	UINT32            CAM_DM_O_HF_GAIN;                 /* 48DC */
	UINT32            CAM_DM_O_HF_COMP;                 /* 48E0 */
	UINT32        CAM_DM_O_HF_CORIN_TH;                 /* 48E4 */
	UINT32            CAM_DM_O_ACT_LUT;                 /* 48E8 */
	UINT32                    rsv_48EC;                 /* 48EC */
	UINT32              CAM_DM_O_SPARE;                 /* 48F0 */
	UINT32                 CAM_DM_O_BB;                 /* 48F4 */
	UINT32                 rsv_48F8[6];                 /* 48F8...490C */
	UINT32                 CAM_CCL_GTC;                 /* 4910 */
	UINT32                 CAM_CCL_ADC;                 /* 4914 */
	UINT32                 CAM_CCL_BAC;                 /* 4918 */
	UINT32                    rsv_491C;                 /* 491C */
	UINT32               CAM_G2G_CNV_1;                 /* 4920 */
	UINT32               CAM_G2G_CNV_2;                 /* 4924 */
	UINT32               CAM_G2G_CNV_3;                 /* 4928 */
	UINT32               CAM_G2G_CNV_4;                 /* 492C */
	UINT32               CAM_G2G_CNV_5;                 /* 4930 */
	UINT32               CAM_G2G_CNV_6;                 /* 4934 */
	UINT32                CAM_G2G_CTRL;                 /* 4938 */
	UINT32                 rsv_493C[3];                 /* 493C...4944 */
	UINT32                CAM_UNP_OFST;                 /* 4948 */
	UINT32                    rsv_494C;                 /* 494C */
	UINT32                 CAM_C02_CON;                 /* 4950 */
	UINT32           CAM_C02_CROP_CON1;                 /* 4954 */
	UINT32           CAM_C02_CROP_CON2;                 /* 4958 */
	UINT32                   rsv_495C;                  /* 495C */
	UINT32                 CAM_MFB_CON;                 /* 4960 */
	UINT32             CAM_MFB_LL_CON1;                 /* 4964 */
	UINT32             CAM_MFB_LL_CON2;                 /* 4968 */
	UINT32             CAM_MFB_LL_CON3;                 /* 496C */
	UINT32             CAM_MFB_LL_CON4;                 /* 4970 */
	UINT32             CAM_MFB_LL_CON5;                 /* 4974 */
	UINT32             CAM_MFB_LL_CON6;                 /* 4978 */
	UINT32                rsv_497C[17];                 /* 497C...49BC */
	UINT32                 CAM_LCE_CON;                 /* 49C0 */
	UINT32                  CAM_LCE_ZR;                 /* 49C4 */
	UINT32                 CAM_LCE_QUA;                 /* 49C8 */
	UINT32               CAM_LCE_DGC_1;                 /* 49CC */
	UINT32               CAM_LCE_DGC_2;                 /* 49D0 */
	UINT32                  CAM_LCE_GM;                 /* 49D4 */
	UINT32                 rsv_49D8[2];                 /* 49D8...49DC */
	UINT32              CAM_LCE_SLM_LB;                 /* 49E0 */
	UINT32            CAM_LCE_SLM_SIZE;                 /* 49E4 */
	UINT32                CAM_LCE_OFST;                 /* 49E8 */
	UINT32                CAM_LCE_BIAS;                 /* 49EC */
	UINT32          CAM_LCE_IMAGE_SIZE;                 /* 49F0 */
	UINT32                 rsv_49F4[3];                 /* 49F4...4A18 */
	UINT32              CAM_CPG_SATU_1;                 /* 4A00 */
	UINT32              CAM_CPG_SATU_2;                 /* 4A04 */
	UINT32              CAM_CPG_GAIN_1;                 /* 4A08 */
	UINT32              CAM_CPG_GAIN_2;                 /* 4A0C */
	UINT32              CAM_CPG_OFST_1;                 /* 4A10 */
	UINT32                rsv_4A18[1];                  /* 4A18 */
	UINT32                 CAM_C42_CON;                 /* 4A1C */
	UINT32                CAM_ANR_CON1;                 /* 4A20 */
	UINT32                CAM_ANR_CON2;                 /* 4A24 */
	UINT32                CAM_ANR_CON3;                 /* 4A28 */
	UINT32                CAM_ANR_YAD1;                 /* 4A2C */
	UINT32                CAM_ANR_YAD2;                 /* 4A30 */
	UINT32               CAM_ANR_4LUT1;                 /* 4A34 */
	UINT32               CAM_ANR_4LUT2;                 /* 4A38 */
	UINT32               CAM_ANR_4LUT3;                 /* 4A3C */
	UINT32                 CAM_ANR_PTY;                 /* 4A40 */
	UINT32                 CAM_ANR_CAD;                 /* 4A44 */
	UINT32                 CAM_ANR_PTC;                 /* 4A48 */
	UINT32                CAM_ANR_LCE1;                 /* 4A4C */
	UINT32                CAM_ANR_LCE2;                 /* 4A50 */
	UINT32                 CAM_ANR_HP1;                 /* 4A54 */
	UINT32                 CAM_ANR_HP2;                 /* 4A58 */
	UINT32                 CAM_ANR_HP3;                 /* 4A5C */
	UINT32                CAM_ANR_ACTY;                 /* 4A60 */
	UINT32                CAM_ANR_ACTC;                 /* 4A64 */
	UINT32                CAM_ANR_RSV1;                 /* 4A68 */
	UINT32                CAM_ANR_RSV2;                 /* 4A6C */
	UINT32                 rsv_4A70[4];                 /* 4A70...4A7C */
	UINT32                 CAM_CCR_CON;                 /* 4A80 */
	UINT32                CAM_CCR_YLUT;                 /* 4A84 */
	UINT32               CAM_CCR_UVLUT;                 /* 4A88 */
	UINT32               CAM_CCR_YLUT2;                 /* 4A8C */
	UINT32            CAM_CCR_SAT_CTRL;                 /* 4A90 */
	UINT32            CAM_CCR_UVLUT_SP;                 /* 4A94 */
	UINT32                 rsv_4A98[2];                 /* 4A98...4A9C */
	UINT32           CAM_SEEE_SRK_CTRL;                 /* 4AA0 */
	UINT32          CAM_SEEE_CLIP_CTRL;                 /* 4AA4 */
	UINT32         CAM_SEEE_FLT_CTRL_1;                 /* 4AA8 */
	UINT32         CAM_SEEE_FLT_CTRL_2;                 /* 4AAC */
	UINT32       CAM_SEEE_GLUT_CTRL_01;                 /* 4AB0 */
	UINT32       CAM_SEEE_GLUT_CTRL_02;                 /* 4AB4 */
	UINT32       CAM_SEEE_GLUT_CTRL_03;                 /* 4AB8 */
	UINT32       CAM_SEEE_GLUT_CTRL_04;                 /* 4ABC */
	UINT32       CAM_SEEE_GLUT_CTRL_05;                 /* 4AC0 */
	UINT32       CAM_SEEE_GLUT_CTRL_06;                 /* 4AC4 */
	UINT32          CAM_SEEE_EDTR_CTRL;                 /* 4AC8 */
	UINT32      CAM_SEEE_OUT_EDGE_CTRL;                 /* 4ACC */
	UINT32          CAM_SEEE_SE_Y_CTRL;                 /* 4AD0 */
	UINT32     CAM_SEEE_SE_EDGE_CTRL_1;                 /* 4AD4 */
	UINT32     CAM_SEEE_SE_EDGE_CTRL_2;                 /* 4AD8 */
	UINT32     CAM_SEEE_SE_EDGE_CTRL_3;                 /* 4ADC */
	UINT32      CAM_SEEE_SE_SPECL_CTRL;                 /* 4AE0 */
	UINT32     CAM_SEEE_SE_CORE_CTRL_1;                 /* 4AE4 */
	UINT32     CAM_SEEE_SE_CORE_CTRL_2;                 /* 4AE8 */
	UINT32       CAM_SEEE_GLUT_CTRL_07;                 /* 4AEC */
	UINT32       CAM_SEEE_GLUT_CTRL_08;                 /* 4AF0 */
	UINT32       CAM_SEEE_GLUT_CTRL_09;                 /* 4AF4 */
	UINT32       CAM_SEEE_GLUT_CTRL_10;                 /* 4AF8 */
	UINT32       CAM_SEEE_GLUT_CTRL_11;                 /* 4AFC */
	UINT32             CAM_CRZ_CONTROL;                 /* 4B00 */
	UINT32              CAM_CRZ_IN_IMG;                 /* 4B04 */
	UINT32             CAM_CRZ_OUT_IMG;                 /* 4B08 */
	UINT32           CAM_CRZ_HORI_STEP;                 /* 4B0C */
	UINT32           CAM_CRZ_VERT_STEP;                 /* 4B10 */
	UINT32  CAM_CRZ_LUMA_HORI_INT_OFST;                 /* 4B14 */
	UINT32  CAM_CRZ_LUMA_HORI_SUB_OFST;                 /* 4B18 */
	UINT32  CAM_CRZ_LUMA_VERT_INT_OFST;                 /* 4B1C */
	UINT32  CAM_CRZ_LUMA_VERT_SUB_OFST;                 /* 4B20 */
	UINT32  CAM_CRZ_CHRO_HORI_INT_OFST;                 /* 4B24 */
	UINT32  CAM_CRZ_CHRO_HORI_SUB_OFST;                 /* 4B28 */
	UINT32  CAM_CRZ_CHRO_VERT_INT_OFST;                 /* 4B2C */
	UINT32  CAM_CRZ_CHRO_VERT_SUB_OFST;                 /* 4B30 */
	UINT32               CAM_CRZ_DER_1;                 /* 4B34 */
	UINT32               CAM_CRZ_DER_2;                 /* 4B38 */
	UINT32                rsv_4B3C[25];                 /* 4B3C...4B9C */
	UINT32             CAM_G2C_CONV_0A;                 /* 4BA0 */
	UINT32             CAM_G2C_CONV_0B;                 /* 4BA4 */
	UINT32             CAM_G2C_CONV_1A;                 /* 4BA8 */
	UINT32             CAM_G2C_CONV_1B;                 /* 4BAC */
	UINT32             CAM_G2C_CONV_2A;                 /* 4BB0 */
	UINT32             CAM_G2C_CONV_2B;                 /* 4BB4 */
	UINT32         CAM_G2C_SHADE_CON_1;                 /* 4BB8 */
	UINT32         CAM_G2C_SHADE_CON_2;                 /* 4BBC */
	UINT32         CAM_G2C_SHADE_CON_3;                 /* 4BC0 */
	UINT32           CAM_G2C_SHADE_TAR;                 /* 4BC4 */
	UINT32            CAM_G2C_SHADE_SP;                 /* 4BC8 */
	UINT32                rsv_4BCC[25];                 /* 4BCC...4C2C */
	UINT32            CAM_SRZ1_CONTROL;                 /* 4C30 */
	UINT32             CAM_SRZ1_IN_IMG;                 /* 4C34 */
	UINT32            CAM_SRZ1_OUT_IMG;                 /* 4C38 */
	UINT32          CAM_SRZ1_HORI_STEP;                 /* 4C3C */
	UINT32          CAM_SRZ1_VERT_STEP;                 /* 4C40 */
	UINT32      CAM_SRZ1_HORI_INT_OFST;                 /* 4C44 */
	UINT32      CAM_SRZ1_HORI_SUB_OFST;                 /* 4C48 */
	UINT32      CAM_SRZ1_VERT_INT_OFST;                 /* 4C4C */
	UINT32      CAM_SRZ1_VERT_SUB_OFST;                 /* 4C50 */
	UINT32                 rsv_4C54[3];                 /* 4C54...4C5C */
	UINT32            CAM_SRZ2_CONTROL;                 /* 4C60 */
	UINT32             CAM_SRZ2_IN_IMG;                 /* 4C64 */
	UINT32            CAM_SRZ2_OUT_IMG;                 /* 4C68 */
	UINT32          CAM_SRZ2_HORI_STEP;                 /* 4C6C */
	UINT32          CAM_SRZ2_VERT_STEP;                 /* 4C70 */
	UINT32      CAM_SRZ2_HORI_INT_OFST;                 /* 4C74 */
	UINT32      CAM_SRZ2_HORI_SUB_OFST;                 /* 4C78 */
	UINT32      CAM_SRZ2_VERT_INT_OFST;                 /* 4C7C */
	UINT32      CAM_SRZ2_VERT_SUB_OFST;                 /* 4C80 */
	UINT32                 rsv_4C84[3];                 /* 4C84...4C8C */
	UINT32             CAM_MIX1_CTRL_0;                 /* 4C90 */
	UINT32             CAM_MIX1_CTRL_1;                 /* 4C94 */
	UINT32              CAM_MIX1_SPARE;                 /* 4C98 */
	UINT32                    rsv_4C9C;                 /* 4C9C */
	UINT32             CAM_MIX2_CTRL_0;                 /* 4CA0 */
	UINT32             CAM_MIX2_CTRL_1;                 /* 4CA4 */
	UINT32              CAM_MIX2_SPARE;                 /* 4CA8 */
	UINT32                    rsv_4CAC;                 /* 4CAC */
	UINT32             CAM_MIX3_CTRL_0;                 /* 4CB0 */
	UINT32             CAM_MIX3_CTRL_1;                 /* 4CB4 */
	UINT32              CAM_MIX3_SPARE;                 /* 4CB8 */
	UINT32                    rsv_4CBC;                 /* 4CBC */
	UINT32              CAM_NR3D_BLEND;                 /* 4CC0 */
	UINT32          CAM_NR3D_FBCNT_OFF;                 /* 4CC4 */
	UINT32          CAM_NR3D_FBCNT_SIZ;                 /* 4CC8 */
	UINT32           CAM_NR3D_FB_COUNT;                 /* 4CCC */
	UINT32            CAM_NR3D_LMT_CPX;                 /* 4CD0 */
	UINT32         CAM_NR3D_LMT_Y_CON1;                 /* 4CD4 */
	UINT32         CAM_NR3D_LMT_Y_CON2;                 /* 4CD8 */
	UINT32         CAM_NR3D_LMT_Y_CON3;                 /* 4CDC */
	UINT32         CAM_NR3D_LMT_U_CON1;                 /* 4CE0 */
	UINT32         CAM_NR3D_LMT_U_CON2;                 /* 4CE4 */
	UINT32         CAM_NR3D_LMT_U_CON3;                 /* 4CE8 */
	UINT32         CAM_NR3D_LMT_V_CON1;                 /* 4CEC */
	UINT32         CAM_NR3D_LMT_V_CON2;                 /* 4CF0 */
	UINT32         CAM_NR3D_LMT_V_CON3;                 /* 4CF4 */
	UINT32               CAM_NR3D_CTRL;                 /* 4CF8 */
	UINT32             CAM_NR3D_ON_OFF;                 /* 4CFC */
	UINT32             CAM_NR3D_ON_SIZ;                 /* 4D00 */
	UINT32             CAM_NR3D_SPARE0;                 /* 4D04 */



	UINT32       CAM_EIS_PREP_ME_CTRL1;                 /* 4DC0 */
	UINT32       CAM_EIS_PREP_ME_CTRL2;                 /* 4DC4 */
	UINT32              CAM_EIS_LMV_TH;                 /* 4DC8 */
	UINT32           CAM_EIS_FL_OFFSET;                 /* 4DCC */
	UINT32           CAM_EIS_MB_OFFSET;                 /* 4DD0 */
	UINT32         CAM_EIS_MB_INTERVAL;                 /* 4DD4 */
	UINT32                 CAM_EIS_GMV;                 /* 4DD8 */
	UINT32            CAM_EIS_ERR_CTRL;                 /* 4DDC */
	UINT32          CAM_EIS_IMAGE_CTRL;                 /* 4DE0 */
	UINT32                 rsv_4DE4[7];                 /* 4DE4...4DFC */
	UINT32                 CAM_DMX_CTL;                 /* 4E00 */
	UINT32                CAM_DMX_CROP;                 /* 4E04 */
	UINT32               CAM_DMX_VSIZE;                 /* 4E08 */
	UINT32                    rsv_4E0C;                 /* 4E0C */
	UINT32                 CAM_BMX_CTL;                 /* 4E10 */
	UINT32                CAM_BMX_CROP;                 /* 4E14 */
	UINT32               CAM_BMX_VSIZE;                 /* 4E18 */
	UINT32                    rsv_4E1C;                 /* 4E1C */
	UINT32                 CAM_RMX_CTL;                 /* 4E20 */
	UINT32                CAM_RMX_CROP;                 /* 4E24 */
	UINT32               CAM_RMX_VSIZE;                 /* 4E28 */
	UINT32                 rsv_4E2C[9];                 /* 4E2C...4E4C */
	UINT32                 CAM_UFE_CON;                 /* 4E50 */


	UINT32                 CAM_SL2_CEN;                 /* 4F40 */
	UINT32             CAM_SL2_MAX0_RR;                 /* 4F44 */
	UINT32             CAM_SL2_MAX1_RR;                 /* 4F48 */
	UINT32             CAM_SL2_MAX2_RR;                 /* 4F4C */
	UINT32                 CAM_SL2_HRZ;                 /* 4F50 */
	UINT32                CAM_SL2_XOFF;                 /* 4F54 */
	UINT32                CAM_SL2_YOFF;                 /* 4F58 */
	UINT32                    rsv_4F5C;                 /* 4F5C */
	UINT32                CAM_SL2B_CEN;                 /* 4F60 */
	UINT32            CAM_SL2B_MAX0_RR;                 /* 4F64 */
	UINT32            CAM_SL2B_MAX1_RR;                 /* 4F68 */
	UINT32            CAM_SL2B_MAX2_RR;                 /* 4F6C */
	UINT32                CAM_SL2B_HRZ;                 /* 4F70 */
	UINT32               CAM_SL2B_XOFF;                 /* 4F74 */
	UINT32               CAM_SL2B_YOFF;                 /* 4F78 */
	UINT32                 rsv_4F7C[9];                 /* 4F7C...4F9C */
	UINT32               CAM_CRSP_CTRL;                 /* 4FA0 */
	UINT32                   rsv_4FA4;                  /* 4FA4 */
	UINT32            CAM_CRSP_OUT_IMG;                 /* 4FA8 */
	UINT32          CAM_CRSP_STEP_OFST;                 /* 4FAC */
	UINT32             CAM_CRSP_CROP_X;                 /* 4FB0 */
	UINT32             CAM_CRSP_CROP_Y;                 /* 4FB4 */
	UINT32                 rsv_4FB8[2];                 /* 4FB8...4FBC */
	UINT32                CAM_SL2C_CEN;                 /* 4FC0 */
	UINT32            CAM_SL2C_MAX0_RR;                 /* 4FC4 */
	UINT32            CAM_SL2C_MAX1_RR;                 /* 4FC8 */
	UINT32            CAM_SL2C_MAX2_RR;                 /* 4FCC */
	UINT32                CAM_SL2C_HRZ;                 /* 4FD0 */
	UINT32               CAM_SL2C_XOFF;                 /* 4FD4 */
	UINT32               CAM_SL2C_YOFF;                 /* 4FD8 */

	UINT32                CAM_GGM_CTRL;                 /* 5480 */

	UINT32                CAM_PCA_CON1;                 /* 5E00 */
	UINT32                CAM_PCA_CON2;                 /* 5E04 */

	UINT32           CAM_TILE_RING_CON1;                /* 5FF0 */
	UINT32           CAM_CTL_IMGI_SIZE;                 /* 5FF4 */



	UINT32            CAM_TG2_SEN_MODE;                 /* 6410 */
	UINT32              CAM_TG2_VF_CON;                 /* 6414 */
	UINT32        CAM_TG2_SEN_GRAB_PXL;                 /* 6418 */
	UINT32        CAM_TG2_SEN_GRAB_LIN;                 /* 641C */
	UINT32            CAM_TG2_PATH_CFG;                 /* 6420 */
	UINT32           CAM_TG2_MEMIN_CTL;                 /* 6424 */


	UINT32            CAM_OBC_D_OFFST0;                 /* 6500 */
	UINT32            CAM_OBC_D_OFFST1;                 /* 6504 */
	UINT32            CAM_OBC_D_OFFST2;                 /* 6508 */
	UINT32            CAM_OBC_D_OFFST3;                 /* 650C */
	UINT32             CAM_OBC_D_GAIN0;                 /* 6510 */
	UINT32             CAM_OBC_D_GAIN1;                 /* 6514 */
	UINT32             CAM_OBC_D_GAIN2;                 /* 6518 */
	UINT32             CAM_OBC_D_GAIN3;                 /* 651C */
	UINT32                 rsv_6520[4];                 /* 6520...652C */
	UINT32              CAM_LSC_D_CTL1;                 /* 6530 */
	UINT32              CAM_LSC_D_CTL2;                 /* 6534 */
	UINT32              CAM_LSC_D_CTL3;                 /* 6538 */
	UINT32            CAM_LSC_D_LBLOCK;                 /* 653C */
	UINT32             CAM_LSC_D_RATIO;                 /* 6540 */
	UINT32        CAM_LSC_D_TPIPE_OFST;                 /* 6544 */
	UINT32        CAM_LSC_D_TPIPE_SIZE;                 /* 6548 */
	UINT32           CAM_LSC_D_GAIN_TH;                 /* 654C */
	UINT32            CAM_RPG_D_SATU_1;                 /* 6550 */
	UINT32            CAM_RPG_D_SATU_2;                 /* 6554 */
	UINT32            CAM_RPG_D_GAIN_1;                 /* 6558 */
	UINT32            CAM_RPG_D_GAIN_2;                 /* 655C */
	UINT32            CAM_RPG_D_OFST_1;                 /* 6560 */
	UINT32            CAM_RPG_D_OFST_2;                 /* 6564 */
	UINT32                rsv_6568[18];                 /* 6568...65AC */
	UINT32           CAM_AWB_D_WIN_ORG;                 /* 65B0 */
	UINT32          CAM_AWB_D_WIN_SIZE;                 /* 65B4 */
	UINT32           CAM_AWB_D_WIN_PIT;                 /* 65B8 */
	UINT32           CAM_AWB_D_WIN_NUM;                 /* 65BC */
	UINT32           CAM_AWB_D_GAIN1_0;                 /* 65C0 */
	UINT32           CAM_AWB_D_GAIN1_1;                 /* 65C4 */
	UINT32            CAM_AWB_D_LMT1_0;                 /* 65C8 */
	UINT32            CAM_AWB_D_LMT1_1;                 /* 65CC */
	UINT32           CAM_AWB_D_LOW_THR;                 /* 65D0 */
	UINT32            CAM_AWB_D_HI_THR;                 /* 65D4 */
	UINT32        CAM_AWB_D_PIXEL_CNT0;                 /* 65D8 */
	UINT32        CAM_AWB_D_PIXEL_CNT1;                 /* 65DC */
	UINT32        CAM_AWB_D_PIXEL_CNT2;                 /* 65E0 */
	UINT32           CAM_AWB_D_ERR_THR;                 /* 65E4 */
	UINT32               CAM_AWB_D_ROT;                 /* 65E8 */
	UINT32              CAM_AWB_D_L0_X;                 /* 65EC */
	UINT32              CAM_AWB_D_L0_Y;                 /* 65F0 */
	UINT32              CAM_AWB_D_L1_X;                 /* 65F4 */
	UINT32              CAM_AWB_D_L1_Y;                 /* 65F8 */
	UINT32              CAM_AWB_D_L2_X;                 /* 65FC */
	UINT32              CAM_AWB_D_L2_Y;                 /* 6600 */
	UINT32              CAM_AWB_D_L3_X;                 /* 6604 */
	UINT32              CAM_AWB_D_L3_Y;                 /* 6608 */
	UINT32              CAM_AWB_D_L4_X;                 /* 660C */
	UINT32              CAM_AWB_D_L4_Y;                 /* 6610 */
	UINT32              CAM_AWB_D_L5_X;                 /* 6614 */
	UINT32              CAM_AWB_D_L5_Y;                 /* 6618 */
	UINT32              CAM_AWB_D_L6_X;                 /* 661C */
	UINT32              CAM_AWB_D_L6_Y;                 /* 6620 */
	UINT32              CAM_AWB_D_L7_X;                 /* 6624 */
	UINT32              CAM_AWB_D_L7_Y;                 /* 6628 */
	UINT32              CAM_AWB_D_L8_X;                 /* 662C */
	UINT32              CAM_AWB_D_L8_Y;                 /* 6630 */
	UINT32              CAM_AWB_D_L9_X;                 /* 6634 */
	UINT32              CAM_AWB_D_L9_Y;                 /* 6638 */
	UINT32             CAM_AWB_D_SPARE;                 /* 663C */
	UINT32                 rsv_6640[4];                 /* 6640...664C */
	UINT32            CAM_AE_D_HST_CTL;                 /* 6650 */
	UINT32            CAM_AE_D_GAIN2_0;                 /* 6654 */
	UINT32            CAM_AE_D_GAIN2_1;                 /* 6658 */
	UINT32             CAM_AE_D_LMT2_0;                 /* 665C */
	UINT32             CAM_AE_D_LMT2_1;                 /* 6660 */
	UINT32           CAM_AE_D_RC_CNV_0;                 /* 6664 */
	UINT32           CAM_AE_D_RC_CNV_1;                 /* 6668 */
	UINT32           CAM_AE_D_RC_CNV_2;                 /* 666C */
	UINT32           CAM_AE_D_RC_CNV_3;                 /* 6670 */
	UINT32           CAM_AE_D_RC_CNV_4;                 /* 6674 */
	UINT32           CAM_AE_D_YGAMMA_0;                 /* 6678 */
	UINT32           CAM_AE_D_YGAMMA_1;                 /* 667C */
	UINT32            CAM_AE_D_HST_SET;                 /* 6680 */
	UINT32           CAM_AE_D_HST0_RNG;                 /* 6684 */
	UINT32           CAM_AE_D_HST1_RNG;                 /* 6688 */
	UINT32           CAM_AE_D_HST2_RNG;                 /* 668C */
	UINT32           CAM_AE_D_HST3_RNG;                 /* 6690 */
	UINT32              CAM_AE_D_SPARE;                 /* 6694 */
	UINT32                 rsv_6698[2];                 /* 6698...669C */
	UINT32              CAM_SGG1_D_PGN;                 /* 66A0 */
	UINT32           CAM_SGG1_D_GMRC_1;                 /* 66A4 */
	UINT32           CAM_SGG1_D_GMRC_2;                 /* 66A8 */
	UINT32                    rsv_66AC;                 /* 66AC */
	UINT32                CAM_AF_D_CON;                 /* 66B0 */
	UINT32             CAM_AF_D_WINX_1;                 /* 66B4 */
	UINT32             CAM_AF_D_WINX_2;                 /* 66B8 */
	UINT32             CAM_AF_D_WINX_3;                 /* 66BC */
	UINT32             CAM_AF_D_WINY_1;                 /* 66C0 */
	UINT32             CAM_AF_D_WINY_2;                 /* 66C4 */
	UINT32             CAM_AF_D_WINY_3;                 /* 66C8 */
	UINT32               CAM_AF_D_SIZE;                 /* 66CC */
	UINT32                    rsv_66D0;                 /* 66D0 */
	UINT32              CAM_AF_D_FLT_1;                 /* 66D4 */
	UINT32              CAM_AF_D_FLT_2;                 /* 66D8 */
	UINT32              CAM_AF_D_FLT_3;                 /* 66DC */
	UINT32                 CAM_AF_D_TH;                 /* 66E0 */
	UINT32          CAM_AF_D_FLO_WIN_1;                 /* 66E4 */
	UINT32         CAM_AF_D_FLO_SIZE_1;                 /* 66E8 */
	UINT32          CAM_AF_D_FLO_WIN_2;                 /* 66EC */
	UINT32         CAM_AF_D_FLO_SIZE_2;                 /* 66F0 */
	UINT32          CAM_AF_D_FLO_WIN_3;                 /* 66F4 */
	UINT32         CAM_AF_D_FLO_SIZE_3;                 /* 66F8 */
	UINT32             CAM_AF_D_FLO_TH;                 /* 66FC */
	UINT32         CAM_AF_D_IMAGE_SIZE;                 /* 6700 */
	UINT32              CAM_AF_D_FLT_4;                 /* 6704 */
	UINT32              CAM_AF_D_FLT_5;                 /* 6708 */
	UINT32             CAM_AF_D_STAT_L;                 /* 670C */
	UINT32             CAM_AF_D_STAT_M;                 /* 6710 */
	UINT32        CAM_AF_D_FLO_STAT_1L;                 /* 6714 */
	UINT32        CAM_AF_D_FLO_STAT_1M;                 /* 6718 */
	UINT32        CAM_AF_D_FLO_STAT_1V;                 /* 671C */
	UINT32        CAM_AF_D_FLO_STAT_2L;                 /* 6720 */
	UINT32        CAM_AF_D_FLO_STAT_2M;                 /* 6724 */
	UINT32        CAM_AF_D_FLO_STAT_2V;                 /* 6728 */
	UINT32        CAM_AF_D_FLO_STAT_3L;                 /* 672C */
	UINT32        CAM_AF_D_FLO_STAT_3M;                 /* 6730 */
	UINT32        CAM_AF_D_FLO_STAT_3V;                 /* 6734 */
	UINT32                 rsv_6738[2];                 /* 6738...673C */
	UINT32               CAM_W2G_D_BLD;                 /* 6740 */
	UINT32              CAM_W2G_D_TH_1;                 /* 6744 */
	UINT32              CAM_W2G_D_TH_2;                 /* 6748 */
	UINT32           CAM_W2G_D_CTL_OFT;                 /* 674C */
	UINT32                 rsv_6750[4];                 /* 6750...675C */
	UINT32              CAM_WBN_D_SIZE;                 /* 6760 */
	UINT32              CAM_WBN_D_MODE;                 /* 6764 */
	UINT32                 rsv_6768[6];                 /* 6768...677C */
	UINT32               CAM_LCS_D_CON;                 /* 6780 */
	UINT32                CAM_LCS_D_ST;                 /* 6784 */
	UINT32               CAM_LCS_D_AWS;                 /* 6788 */
	UINT32               CAM_LCS_D_FLR;                 /* 678C */
	UINT32            CAM_LCS_D_LRZR_1;                 /* 6790 */
	UINT32            CAM_LCS_D_LRZR_2;                 /* 6794 */
	UINT32                 rsv_6798[2];                 /* 6798...679C */
	UINT32               CAM_RRZ_D_CTL;                 /* 67A0 */
	UINT32            CAM_RRZ_D_IN_IMG;                 /* 67A4 */
	UINT32           CAM_RRZ_D_OUT_IMG;                 /* 67A8 */
	UINT32         CAM_RRZ_D_HORI_STEP;                 /* 67AC */
	UINT32         CAM_RRZ_D_VERT_STEP;                 /* 67B0 */
	UINT32     CAM_RRZ_D_HORI_INT_OFST;                 /* 67B4 */
	UINT32     CAM_RRZ_D_HORI_SUB_OFST;                 /* 67B8 */
	UINT32     CAM_RRZ_D_VERT_INT_OFST;                 /* 67BC */
	UINT32     CAM_RRZ_D_VERT_SUB_OFST;                 /* 67C0 */
	UINT32           CAM_RRZ_D_MODE_TH;                 /* 67C4 */
	UINT32          CAM_RRZ_D_MODE_CTL;                 /* 67C8 */
	UINT32                rsv_67CC[13];                 /* 67CC...67FC */
	UINT32               CAM_BPC_D_CON;                 /* 6800 */
	UINT32               CAM_BPC_D_TH1;                 /* 6804 */
	UINT32               CAM_BPC_D_TH2;                 /* 6808 */
	UINT32               CAM_BPC_D_TH3;                 /* 680C */
	UINT32               CAM_BPC_D_TH4;                 /* 6810 */
	UINT32               CAM_BPC_D_DTC;                 /* 6814 */
	UINT32               CAM_BPC_D_COR;                 /* 6818 */
	UINT32             CAM_BPC_D_TBLI1;                 /* 681C */
	UINT32             CAM_BPC_D_TBLI2;                 /* 6820 */
	UINT32             CAM_BPC_D_TH1_C;                 /* 6824 */
	UINT32             CAM_BPC_D_TH2_C;                 /* 6828 */
	UINT32             CAM_BPC_D_TH3_C;                 /* 682C */
	UINT32              CAM_BPC_D_RMM1;                 /* 6830 */
	UINT32              CAM_BPC_D_RMM2;                 /* 6834 */
	UINT32        CAM_BPC_D_RMM_REVG_1;                 /* 6838 */
	UINT32        CAM_BPC_D_RMM_REVG_2;                 /* 683C */
	UINT32          CAM_BPC_D_RMM_LEOS;                 /* 6840 */
	UINT32          CAM_BPC_D_RMM_GCNT;                 /* 6844 */
	UINT32                 rsv_6848[2];                 /* 6848...684C */
	UINT32               CAM_NR1_D_CON;                 /* 6850 */
	UINT32            CAM_NR1_D_CT_CON;                 /* 6854 */

	UINT32               CAM_DMX_D_CTL;                  /* 6E00 */
	UINT32              CAM_DMX_D_CROP;                  /* 6E04 */
	UINT32             CAM_DMX_D_VSIZE;                  /* 6E08 */
	UINT32                    rsv_6E0C;                  /* 6E0C */
	UINT32               CAM_BMX_D_CTL;                  /* 6E10 */
	UINT32              CAM_BMX_D_CROP;                  /* 6E14 */
	UINT32             CAM_BMX_D_VSIZE;                  /* 6E18 */
	UINT32                    rsv_6E1C;                  /* 6E1C */
	UINT32               CAM_RMX_D_CTL;                  /* 6E20 */
	UINT32              CAM_RMX_D_CROP;                  /* 6E24 */
	UINT32             CAM_RMX_D_VSIZE;                  /* 6E28 */

	UINT32          CAM_TDRI_BASE_ADDR;                 /* 7204 */
	UINT32          CAM_TDRI_OFST_ADDR;                 /* 7208 */
	UINT32              CAM_TDRI_XSIZE;                 /* 720C */
	UINT32          CAM_CQ0I_BASE_ADDR;                 /* 7210 */
	UINT32              CAM_CQ0I_XSIZE;                 /* 7214 */
	UINT32        CAM_CQ0I_D_BASE_ADDR;                 /* 7218 */
	UINT32            CAM_CQ0I_D_XSIZE;                 /* 721C */
	UINT32        CAM_VERTICAL_FLIP_EN;                 /* 7220 */
	UINT32          CAM_DMA_SOFT_RESET;                 /* 7224 */
	UINT32           CAM_LAST_ULTRA_EN;                 /* 7228 */
	UINT32          CAM_IMGI_SLOW_DOWN;                 /* 722C */
	UINT32          CAM_IMGI_BASE_ADDR;                 /* 7230 */
	UINT32          CAM_IMGI_OFST_ADDR;                 /* 7234 */
	UINT32              CAM_IMGI_XSIZE;                 /* 7238 */
	UINT32              CAM_IMGI_YSIZE;                 /* 723C */
	UINT32             CAM_IMGI_STRIDE;                 /* 7240 */
	UINT32                    rsv_7244;                 /* 7244 */
	UINT32                CAM_IMGI_CON;                 /* 7248 */
	UINT32               CAM_IMGI_CON2;                 /* 724C */

	UINT32          CAM_BPCI_BASE_ADDR;                  /* 7250 */
	UINT32          CAM_BPCI_OFST_ADDR;                  /* 7254 */
	UINT32              CAM_BPCI_XSIZE;                  /* 7258 */
	UINT32              CAM_BPCI_YSIZE;                  /* 725C */
	UINT32             CAM_BPCI_STRIDE;                  /* 7260 */
	UINT32                CAM_BPCI_CON;                  /* 7264 */
	UINT32               CAM_BPCI_CON2;                  /* 7268 */

	UINT32          CAM_LSCI_BASE_ADDR;                  /* 726C */
	UINT32          CAM_LSCI_OFST_ADDR;                  /* 7270 */
	UINT32              CAM_LSCI_XSIZE;                  /* 7274 */
	UINT32              CAM_LSCI_YSIZE;                  /* 7278 */
	UINT32             CAM_LSCI_STRIDE;                  /* 727C */
	UINT32                CAM_LSCI_CON;                  /* 7280 */
	UINT32               CAM_LSCI_CON2;                  /* 7284 */
	UINT32          CAM_UFDI_BASE_ADDR;                  /* 7288 */
	UINT32          CAM_UFDI_OFST_ADDR;                  /* 728C */
	UINT32              CAM_UFDI_XSIZE;                  /* 7290 */
	UINT32              CAM_UFDI_YSIZE;                  /* 7294 */
	UINT32             CAM_UFDI_STRIDE;                  /* 7298 */
	UINT32                CAM_UFDI_CON;                  /* 729C */
	UINT32               CAM_UFDI_CON2;                  /* 72A0 */
	UINT32          CAM_LCEI_BASE_ADDR;                  /* 72A4 */
	UINT32          CAM_LCEI_OFST_ADDR;                  /* 72A8 */
	UINT32              CAM_LCEI_XSIZE;                  /* 72AC */
	UINT32              CAM_LCEI_YSIZE;                  /* 72B0 */
	UINT32             CAM_LCEI_STRIDE;                  /* 72B4 */
	UINT32                CAM_LCEI_CON;                  /* 72B8 */
	UINT32               CAM_LCEI_CON2;                  /* 72BC */
	UINT32          CAM_VIPI_BASE_ADDR;                  /* 72C0 */
	UINT32          CAM_VIPI_OFST_ADDR;                  /* 72C4 */
	UINT32              CAM_VIPI_XSIZE;                  /* 72C8 */
	UINT32              CAM_VIPI_YSIZE;                  /* 72CC */
	UINT32             CAM_VIPI_STRIDE;                  /* 72D0 */
	UINT32                    rsv_72D4;                  /* 72D4 */
	UINT32                CAM_VIPI_CON;                  /* 72D8 */
	UINT32               CAM_VIPI_CON2;                  /* 72DC */
	UINT32         CAM_VIP2I_BASE_ADDR;                  /* 72E0 */
	UINT32         CAM_VIP2I_OFST_ADDR;                  /* 72E4 */
	UINT32             CAM_VIP2I_XSIZE;                  /* 72E8 */
	UINT32             CAM_VIP2I_YSIZE;                  /* 72EC */
	UINT32            CAM_VIP2I_STRIDE;                  /* 72F0 */
	UINT32                    rsv_72F4;                  /* 72F4 */
	UINT32               CAM_VIP2I_CON;                  /* 72F8 */
	UINT32              CAM_VIP2I_CON2;                  /* 72FC */
	UINT32          CAM_IMGO_BASE_ADDR;                  /* 7300 */
	UINT32          CAM_IMGO_OFST_ADDR;                  /* 7304 */
	UINT32              CAM_IMGO_XSIZE;                  /* 7308 */
	UINT32              CAM_IMGO_YSIZE;                  /* 730C */
	UINT32             CAM_IMGO_STRIDE;                  /* 7310 */
	UINT32                CAM_IMGO_CON;                  /* 7314 */
	UINT32               CAM_IMGO_CON2;                  /* 7318 */
	UINT32               CAM_IMGO_CROP;                  /* 731C */

	UINT32          CAM_RRZO_BASE_ADDR;                  /* 7320 */
	UINT32          CAM_RRZO_OFST_ADDR;                  /* 7324 */
	UINT32              CAM_RRZO_XSIZE;                  /* 7328 */
	UINT32              CAM_RRZO_YSIZE;                  /* 732C */
	UINT32             CAM_RRZO_STRIDE;                  /* 7330 */
	UINT32                CAM_RRZO_CON;                  /* 7334 */
	UINT32               CAM_RRZO_CON2;                  /* 7338 */
	UINT32               CAM_RRZO_CROP;                  /* 733C */
	UINT32          CAM_LCSO_BASE_ADDR;                  /* 7340 */
	UINT32          CAM_LCSO_OFST_ADDR;                  /* 7344 */
	UINT32              CAM_LCSO_XSIZE;                  /* 7348 */
	UINT32              CAM_LCSO_YSIZE;                  /* 734C */
	UINT32             CAM_LCSO_STRIDE;                  /* 7350 */
	UINT32                CAM_LCSO_CON;                  /* 7354 */
	UINT32               CAM_LCSO_CON2;                  /* 7358 */
	UINT32          CAM_EISO_BASE_ADDR;                  /* 735C */
	UINT32              CAM_EISO_XSIZE;                  /* 7360 */
	UINT32           CAM_AFO_BASE_ADDR;                  /* 7364 */
	UINT32               CAM_AFO_XSIZE;                  /* 7368 */
	UINT32         CAM_ESFKO_BASE_ADDR;                  /* 736C */
	UINT32             CAM_ESFKO_XSIZE;                  /* 7370 */


	UINT32             CAM_ESFKO_YSIZE;                  /* 7378 */
	UINT32            CAM_ESFKO_STRIDE;                  /* 737C */
	UINT32               CAM_ESFKO_CON;                  /* 7380 */
	UINT32              CAM_ESFKO_CON2;                  /* 7384 */

	UINT32           CAM_AAO_BASE_ADDR;                  /* 7388 */
	UINT32           CAM_AAO_OFST_ADDR;                  /* 738C */
	UINT32               CAM_AAO_XSIZE;                  /* 7390 */
	UINT32               CAM_AAO_YSIZE;                  /* 7394 */
	UINT32              CAM_AAO_STRIDE;                  /* 7398 */
	UINT32                 CAM_AAO_CON;                  /* 739C */
	UINT32                CAM_AAO_CON2;                  /* 73A0 */

	UINT32         CAM_VIP3I_BASE_ADDR;                  /* 73A4 */
	UINT32         CAM_VIP3I_OFST_ADDR;                  /* 73A8 */
	UINT32             CAM_VIP3I_XSIZE;                  /* 73AC */
	UINT32             CAM_VIP3I_YSIZE;                  /* 73B0 */
	UINT32            CAM_VIP3I_STRIDE;                  /* 73B4 */
	UINT32                    rsv_73B8;                  /* 73B8 */
	UINT32               CAM_VIP3I_CON;                  /* 73BC */
	UINT32              CAM_VIP3I_CON2;                  /* 73C0 */
	UINT32          CAM_UFEO_BASE_ADDR;                  /* 73C4 */
	UINT32          CAM_UFEO_OFST_ADDR;                  /* 73C8 */
	UINT32              CAM_UFEO_XSIZE;                  /* 73CC */
	UINT32              CAM_UFEO_YSIZE;                  /* 73D0 */
	UINT32             CAM_UFEO_STRIDE;                  /* 73D4 */
	UINT32                CAM_UFEO_CON;                  /* 73D8 */
	UINT32               CAM_UFEO_CON2;                  /* 73DC */
	UINT32          CAM_MFBO_BASE_ADDR;                  /* 73E0 */
	UINT32          CAM_MFBO_OFST_ADDR;                  /* 73E4 */
	UINT32              CAM_MFBO_XSIZE;                  /* 73E8 */
	UINT32              CAM_MFBO_YSIZE;                  /* 73EC */
	UINT32             CAM_MFBO_STRIDE;                  /* 73F0 */
	UINT32                CAM_MFBO_CON;                  /* 73F4 */
	UINT32               CAM_MFBO_CON2;                  /* 73F8 */
	UINT32               CAM_MFBO_CROP;                  /* 73FC */
	UINT32        CAM_IMG3BO_BASE_ADDR;                  /* 7400 */
	UINT32        CAM_IMG3BO_OFST_ADDR;                  /* 7404 */
	UINT32            CAM_IMG3BO_XSIZE;                  /* 7408 */
	UINT32            CAM_IMG3BO_YSIZE;                  /* 740C */
	UINT32           CAM_IMG3BO_STRIDE;                  /* 7410 */
	UINT32              CAM_IMG3BO_CON;                  /* 7414 */
	UINT32             CAM_IMG3BO_CON2;                  /* 7418 */
	UINT32             CAM_IMG3BO_CROP;                  /* 741C */
	UINT32        CAM_IMG3CO_BASE_ADDR;                  /* 7420 */
	UINT32        CAM_IMG3CO_OFST_ADDR;                  /* 7424 */
	UINT32            CAM_IMG3CO_XSIZE;                  /* 7428 */
	UINT32            CAM_IMG3CO_YSIZE;                  /* 742C */
	UINT32           CAM_IMG3CO_STRIDE;                  /* 7430 */
	UINT32              CAM_IMG3CO_CON;                  /* 7434 */
	UINT32             CAM_IMG3CO_CON2;                  /* 7438 */
	UINT32             CAM_IMG3CO_CROP;                  /* 743C */
	UINT32         CAM_IMG2O_BASE_ADDR;                  /* 7440 */
	UINT32         CAM_IMG2O_OFST_ADDR;                  /* 7444 */
	UINT32             CAM_IMG2O_XSIZE;                  /* 7448 */
	UINT32             CAM_IMG2O_YSIZE;                  /* 744C */
	UINT32            CAM_IMG2O_STRIDE;                  /* 7450 */
	UINT32               CAM_IMG2O_CON;                  /* 7454 */
	UINT32              CAM_IMG2O_CON2;                  /* 7458 */
	UINT32              CAM_IMG2O_CROP;                  /* 745C */
	UINT32         CAM_IMG3O_BASE_ADDR;                  /* 7460 */
	UINT32         CAM_IMG3O_OFST_ADDR;                  /* 7464 */
	UINT32             CAM_IMG3O_XSIZE;                  /* 7468 */
	UINT32             CAM_IMG3O_YSIZE;                  /* 746C */
	UINT32            CAM_IMG3O_STRIDE;                  /* 7470 */
	UINT32               CAM_IMG3O_CON;                  /* 7474 */
	UINT32              CAM_IMG3O_CON2;                  /* 7478 */
	UINT32              CAM_IMG3O_CROP;                  /* 747C */
	UINT32           CAM_FEO_BASE_ADDR;                  /* 7480 */
	UINT32           CAM_FEO_OFST_ADDR;                  /* 7484 */
	UINT32               CAM_FEO_XSIZE;                  /* 7488 */
	UINT32               CAM_FEO_YSIZE;                  /* 748C */
	UINT32              CAM_FEO_STRIDE;                  /* 7490 */
	UINT32                 CAM_FEO_CON;                  /* 7494 */
	UINT32                CAM_FEO_CON2;                  /* 7498 */



	UINT32        CAM_BPCI_D_BASE_ADDR;                  /* 749C */
	UINT32        CAM_BPCI_D_OFST_ADDR;                  /* 74A0 */
	UINT32            CAM_BPCI_D_XSIZE;                  /* 74A4 */
	UINT32            CAM_BPCI_D_YSIZE;                  /* 74A8 */
	UINT32           CAM_BPCI_D_STRIDE;                  /* 74AC */
	UINT32              CAM_BPCI_D_CON;                  /* 74B0 */
	UINT32             CAM_BPCI_D_CON2;                  /* 74B4 */

	UINT32        CAM_LSCI_D_BASE_ADDR;                  /* 74B8 */
	UINT32        CAM_LSCI_D_OFST_ADDR;                  /* 74BC */
	UINT32            CAM_LSCI_D_XSIZE;                  /* 74C0 */
	UINT32            CAM_LSCI_D_YSIZE;                  /* 74C4 */
	UINT32           CAM_LSCI_D_STRIDE;                  /* 74C8 */
	UINT32              CAM_LSCI_D_CON;                  /* 74CC */
	UINT32             CAM_LSCI_D_CON2;                  /* 74D0 */

	UINT32        CAM_IMGO_D_BASE_ADDR;                  /* 74D4 */
	UINT32        CAM_IMGO_D_OFST_ADDR;                  /* 74D8 */
	UINT32            CAM_IMGO_D_XSIZE;                  /* 74DC */
	UINT32            CAM_IMGO_D_YSIZE;                  /* 74E0 */
	UINT32           CAM_IMGO_D_STRIDE;                  /* 74E4 */
	UINT32              CAM_IMGO_D_CON;                  /* 74E8 */
	UINT32             CAM_IMGO_D_CON2;                  /* 74EC */
	UINT32             CAM_IMGO_D_CROP;                  /* 74F0 */

	UINT32        CAM_RRZO_D_BASE_ADDR;                  /* 74F4 */
	UINT32        CAM_RRZO_D_OFST_ADDR;                  /* 74F8 */
	UINT32            CAM_RRZO_D_XSIZE;                  /* 74FC */
	UINT32            CAM_RRZO_D_YSIZE;                  /* 7500 */
	UINT32           CAM_RRZO_D_STRIDE;                  /* 7504 */
	UINT32              CAM_RRZO_D_CON;                  /* 7508 */
	UINT32             CAM_RRZO_D_CON2;                  /* 750C */
	UINT32             CAM_RRZO_D_CROP;                  /* 7510 */

	UINT32        CAM_LCSO_D_BASE_ADDR;                  /* 7514 */
	UINT32        CAM_LCSO_D_OFST_ADDR;                  /* 7518 */
	UINT32            CAM_LCSO_D_XSIZE;                  /* 751C */
	UINT32            CAM_LCSO_D_YSIZE;                  /* 7520 */
	UINT32           CAM_LCSO_D_STRIDE;                  /* 7524 */
	UINT32              CAM_LCSO_D_CON;                  /* 7528 */
	UINT32             CAM_LCSO_D_CON2;                  /* 752C */

	UINT32         CAM_AFO_D_BASE_ADDR;                  /* 7530 */
	UINT32             CAM_AFO_D_XSIZE;                  /* 7534 */

	UINT32             CAM_AFO_D_YSIZE;                  /* 753C */
	UINT32            CAM_AFO_D_STRIDE;                  /* 7540 */
	UINT32               CAM_AFO_D_CON;                  /* 7544 */
	UINT32              CAM_AFO_D_CON2;                  /* 7548 */

	UINT32         CAM_AAO_D_BASE_ADDR;                  /* 754C */
	UINT32         CAM_AAO_D_OFST_ADDR;                  /* 7550 */
	UINT32             CAM_AAO_D_XSIZE;                  /* 7554 */
	UINT32             CAM_AAO_D_YSIZE;                  /* 7558 */
	UINT32            CAM_AAO_D_STRIDE;                  /* 755C */
	UINT32               CAM_AAO_D_CON;                  /* 7560 */
	UINT32              CAM_AAO_D_CON2;                  /* 7564 */

} _isp_backup_reg_t;



typedef struct _seninf_backup_reg {
	UINT32             SENINF_TOP_CTRL;                /* 8000 */
	UINT32       SENINF_TOP_CMODEL_PAR;                /* 8004 */
	UINT32         SENINF_TOP_MUX_CTRL;                /* 8008 */
	UINT32                rsv_800C[45];                /* 800C...80BC */
	UINT32                     N3D_CTL;                /* 80C0 */
	UINT32                     N3D_POS;                /* 80C4 */
	UINT32                    N3D_TRIG;                /* 80C8 */
	UINT32                     N3D_INT;                        /* 80CC */
	UINT32                    N3D_CNT0;                       /* 80D0 */
	UINT32                    N3D_CNT1;                       /* 80D4 */
	UINT32                     N3D_DBG;                        /* 80D8 */
	UINT32                N3D_DIFF_THR;                   /* 80DC */
	UINT32                N3D_DIFF_CNT;                   /* 80E0 */
	UINT32                          rsv_80E4[7];                    /* 80E4...80FC */
	UINT32                SENINF1_CTRL;                   /* 8100 */
	UINT32                          rsv_8104[7];                    /* 8104...811C */
	UINT32            SENINF1_MUX_CTRL;               /* 8120 */
	UINT32           SENINF1_MUX_INTEN;              /* 8124 */
	UINT32          SENINF1_MUX_INTSTA;             /* 8128 */
	UINT32            SENINF1_MUX_SIZE;               /* 812C */
	UINT32         SENINF1_MUX_DEBUG_1;            /* 8130 */
	UINT32         SENINF1_MUX_DEBUG_2;            /* 8134 */
	UINT32         SENINF1_MUX_DEBUG_3;            /* 8138 */
	UINT32         SENINF1_MUX_DEBUG_4;            /* 813C */
	UINT32         SENINF1_MUX_DEBUG_5;            /* 8140 */
	UINT32         SENINF1_MUX_DEBUG_6;            /* 8144 */
	UINT32         SENINF1_MUX_DEBUG_7;            /* 8148 */
	UINT32           SENINF1_MUX_SPARE;              /* 814C */
	UINT32            SENINF1_MUX_DATA;               /* 8150 */
	UINT32        SENINF1_MUX_DATA_CNT;           /* 8154 */
	UINT32            SENINF1_MUX_CROP;               /* 8158 */
	UINT32                          rsv_815C[41];                   /* 815C...81FC */
	UINT32           SENINF_TG1_PH_CNT;              /* 8200 */
	UINT32           SENINF_TG1_SEN_CK;              /* 8204 */
	UINT32           SENINF_TG1_TM_CTL;              /* 8208 */
	UINT32          SENINF_TG1_TM_SIZE;             /* 820C */
	UINT32           SENINF_TG1_TM_CLK;              /* 8210 */
	UINT32                          rsv_8214[59];                   /* 8214...82FC */
	UINT32          MIPI_RX_CON00_CSI0;             /* 8300 */
	UINT32          MIPI_RX_CON04_CSI0;             /* 8304 */
	UINT32          MIPI_RX_CON08_CSI0;             /* 8308 */
	UINT32          MIPI_RX_CON0C_CSI0;             /* 830C */
	UINT32          MIPI_RX_CON10_CSI0;             /* 8310 */
	UINT32                          rsv_8314[4];                    /* 8314...8320 */
	UINT32          MIPI_RX_CON24_CSI0;             /* 8324 */
	UINT32          MIPI_RX_CON28_CSI0;             /* 8328 */
	UINT32                          rsv_832C[2];                    /* 832C...8330 */
	UINT32          MIPI_RX_CON34_CSI0;             /* 8334 */
	UINT32          MIPI_RX_CON38_CSI0;             /* 8338 */
	UINT32          MIPI_RX_CON3C_CSI0;             /* 833C */
	UINT32          MIPI_RX_CON40_CSI0;             /* 8340 */
	UINT32          MIPI_RX_CON44_CSI0;             /* 8344 */
	UINT32          MIPI_RX_CON48_CSI0;             /* 8348 */
	UINT32                          rsv_834C;                       /* 834C */
	UINT32          MIPI_RX_CON50_CSI0;             /* 8350 */
	UINT32                          rsv_8354[3];                    /* 8354...835C */
	UINT32           SENINF1_CSI2_CTRL;              /* 8360 */
	UINT32          SENINF1_CSI2_DELAY;             /* 8364 */
	UINT32          SENINF1_CSI2_INTEN;             /* 8368 */
	UINT32         SENINF1_CSI2_INTSTA;            /* 836C */
	UINT32         SENINF1_CSI2_ECCDBG;            /* 8370 */
	UINT32         SENINF1_CSI2_CRCDBG;            /* 8374 */
	UINT32            SENINF1_CSI2_DBG;               /* 8378 */
	UINT32            SENINF1_CSI2_VER;               /* 837C */
	UINT32     SENINF1_CSI2_SHORT_INFO;        /* 8380 */
	UINT32          SENINF1_CSI2_LNFSM;             /* 8384 */
	UINT32          SENINF1_CSI2_LNMUX;             /* 8388 */
	UINT32      SENINF1_CSI2_HSYNC_CNT;         /* 838C */
	UINT32            SENINF1_CSI2_CAL;               /* 8390 */
	UINT32             SENINF1_CSI2_DS;                /* 8394 */
	UINT32             SENINF1_CSI2_VS;                /* 8398 */
	UINT32           SENINF1_CSI2_BIST;              /* 839C */
	UINT32           SENINF1_NCSI2_CTL;              /* 83A0 */
	UINT32   SENINF1_NCSI2_LNRC_TIMING;      /* 83A4 */
	UINT32   SENINF1_NCSI2_LNRD_TIMING;      /* 83A8 */
	UINT32          SENINF1_NCSI2_DPCM;             /* 83AC */
	UINT32        SENINF1_NCSI2_INT_EN;           /* 83B0 */
	UINT32    SENINF1_NCSI2_INT_STATUS;       /* 83B4 */
	UINT32       SENINF1_NCSI2_DGB_SEL;          /* 83B8 */
	UINT32      SENINF1_NCSI2_DBG_PORT;         /* 83BC */
	UINT32        SENINF1_NCSI2_SPARE0;           /* 83C0 */
	UINT32        SENINF1_NCSI2_SPARE1;           /* 83C4 */
	UINT32      SENINF1_NCSI2_LNRC_FSM;         /* 83C8 */
	UINT32      SENINF1_NCSI2_LNRD_FSM;         /* 83CC */
	UINT32 SENINF1_NCSI2_FRAME_LINE_NUM;   /* 83D0 */
	UINT32 SENINF1_NCSI2_GENERIC_SHORT;    /* 83D4 */
	UINT32      SENINF1_NCSI2_HSRX_DBG;         /* 83D8 */
	UINT32            SENINF1_NCSI2_DI;               /* 83DC */
	UINT32      SENINF1_NCSI2_HS_TRAIL;         /* 83E0 */
	UINT32       SENINF1_NCSI2_DI_CTRL;          /* 83E4 */
	UINT32                          rsv_83E8[70];                   /* 83E8...84FC */
	UINT32                SENINF2_CTRL;                   /* 8500 */
	UINT32                          rsv_8504[7];                    /* 8504...851C */
	UINT32            SENINF2_MUX_CTRL;               /* 8520 */
	UINT32           SENINF2_MUX_INTEN;              /* 8524 */
	UINT32          SENINF2_MUX_INTSTA;             /* 8528 */
	UINT32            SENINF2_MUX_SIZE;               /* 852C */
	UINT32         SENINF2_MUX_DEBUG_1;            /* 8530 */
	UINT32         SENINF2_MUX_DEBUG_2;            /* 8534 */
	UINT32         SENINF2_MUX_DEBUG_3;            /* 8538 */
	UINT32         SENINF2_MUX_DEBUG_4;            /* 853C */
	UINT32         SENINF2_MUX_DEBUG_5;            /* 8540 */
	UINT32         SENINF2_MUX_DEBUG_6;            /* 8544 */
	UINT32         SENINF2_MUX_DEBUG_7;            /* 8548 */
	UINT32           SENINF2_MUX_SPARE;              /* 854C */
	UINT32            SENINF2_MUX_DATA;               /* 8550 */
	UINT32        SENINF2_MUX_DATA_CNT;           /* 8554 */
	UINT32            SENINF2_MUX_CROP;               /* 8558 */
	UINT32                          rsv_855C[41];                   /* 855C...85FC */
	UINT32           SENINF_TG2_PH_CNT;              /* 8600 */
	UINT32           SENINF_TG2_SEN_CK;              /* 8604 */
	UINT32           SENINF_TG2_TM_CTL;              /* 8608 */
	UINT32          SENINF_TG2_TM_SIZE;             /* 860C */
	UINT32           SENINF_TG2_TM_CLK;              /* 8610 */
	UINT32                          rsv_8614[59];                   /* 8614...86FC */
	UINT32          MIPI_RX_CON00_CSI1;             /* 8700 */
	UINT32          MIPI_RX_CON04_CSI1;             /* 8704 */
	UINT32          MIPI_RX_CON08_CSI1;             /* 8708 */
	UINT32          MIPI_RX_CON0C_CSI1;             /* 870C */
	UINT32          MIPI_RX_CON10_CSI1;             /* 8710 */
	UINT32                          rsv_8714[4];                    /* 8714...8720 */
	UINT32          MIPI_RX_CON24_CSI1;             /* 8724 */
	UINT32          MIPI_RX_CON28_CSI1;             /* 8728 */
	UINT32                          rsv_872C[2];                    /* 872C...8730 */
	UINT32          MIPI_RX_CON34_CSI1;             /* 8734 */
	UINT32          MIPI_RX_CON38_CSI1;             /* 8738 */
	UINT32          MIPI_RX_CON3C_CSI1;             /* 873C */
	UINT32          MIPI_RX_CON40_CSI1;             /* 8740 */
	UINT32          MIPI_RX_CON44_CSI1;             /* 8744 */
	UINT32          MIPI_RX_CON48_CSI1;             /* 8748 */
	UINT32                          rsv_874C;                       /* 874C */
	UINT32          MIPI_RX_CON50_CSI1;             /* 8750 */
	UINT32                          rsv_8754[3];                    /* 8754...875C */
	UINT32           SENINF2_CSI2_CTRL;              /* 8760 */
	UINT32          SENINF2_CSI2_DELAY;             /* 8764 */
	UINT32          SENINF2_CSI2_INTEN;             /* 8768 */
	UINT32         SENINF2_CSI2_INTSTA;            /* 876C */
	UINT32         SENINF2_CSI2_ECCDBG;            /* 8770 */
	UINT32         SENINF2_CSI2_CRCDBG;            /* 8774 */
	UINT32            SENINF2_CSI2_DBG;               /* 8778 */
	UINT32            SENINF2_CSI2_VER;               /* 877C */
	UINT32     SENINF2_CSI2_SHORT_INFO;        /* 8780 */
	UINT32          SENINF2_CSI2_LNFSM;             /* 8784 */
	UINT32          SENINF2_CSI2_LNMUX;             /* 8788 */
	UINT32      SENINF2_CSI2_HSYNC_CNT;         /* 878C */
	UINT32            SENINF2_CSI2_CAL;               /* 8790 */
	UINT32             SENINF2_CSI2_DS;                /* 8794 */
	UINT32             SENINF2_CSI2_VS;                /* 8798 */
	UINT32           SENINF2_CSI2_BIST;              /* 879C */
	UINT32           SENINF2_NCSI2_CTL;              /* 87A0 */
	UINT32   SENINF2_NCSI2_LNRC_TIMING;      /* 87A4 */
	UINT32   SENINF2_NCSI2_LNRD_TIMING;      /* 87A8 */
	UINT32          SENINF2_NCSI2_DPCM;             /* 87AC */
	UINT32        SENINF2_NCSI2_INT_EN;           /* 87B0 */
	UINT32    SENINF2_NCSI2_INT_STATUS;       /* 87B4 */
	UINT32       SENINF2_NCSI2_DGB_SEL;          /* 87B8 */
	UINT32      SENINF2_NCSI2_DBG_PORT;         /* 87BC */
	UINT32        SENINF2_NCSI2_SPARE0;           /* 87C0 */
	UINT32        SENINF2_NCSI2_SPARE1;           /* 87C4 */
	UINT32      SENINF2_NCSI2_LNRC_FSM;         /* 87C8 */
	UINT32      SENINF2_NCSI2_LNRD_FSM;         /* 87CC */
	UINT32 SENINF2_NCSI2_FRAME_LINE_NUM;   /* 87D0 */
	UINT32 SENINF2_NCSI2_GENERIC_SHORT;    /* 87D4 */
	UINT32      SENINF2_NCSI2_HSRX_DBG;         /* 87D8 */
	UINT32            SENINF2_NCSI2_DI;               /* 87DC */
	UINT32      SENINF2_NCSI2_HS_TRAIL;         /* 87E0 */
	UINT32       SENINF2_NCSI2_DI_CTRL;          /* 87E4 */

	UINT32      MIPIRX_ANALOG_BASE_000;
	UINT32      MIPIRX_ANALOG_BASE_004;
	UINT32      MIPIRX_ANALOG_BASE_008;
	UINT32      MIPIRX_ANALOG_BASE_00C;
	UINT32      MIPIRX_ANALOG_BASE_010;
	UINT32      MIPIRX_ANALOG_BASE_014;
	UINT32      MIPIRX_ANALOG_BASE_018;
	UINT32      MIPIRX_ANALOG_BASE_01C;
	UINT32      MIPIRX_ANALOG_BASE_020;
	UINT32      MIPIRX_ANALOG_BASE_024;
	UINT32      MIPIRX_ANALOG_BASE_028;
	UINT32      MIPIRX_ANALOG_BASE_02C;
	UINT32      MIPIRX_ANALOG_BASE_030;
	UINT32      MIPIRX_ANALOG_BASE_034;
	UINT32      MIPIRX_ANALOG_BASE_038;
	UINT32      MIPIRX_ANALOG_BASE_03C;
	UINT32      MIPIRX_ANALOG_BASE_040;
	UINT32      MIPIRX_ANALOG_BASE_044;
	UINT32      MIPIRX_ANALOG_BASE_048;
	UINT32      MIPIRX_ANALOG_BASE_04C;
	UINT32      MIPIRX_ANALOG_BASE_050;
	UINT32      MIPIRX_ANALOG_BASE_054;
	UINT32      MIPIRX_ANALOG_BASE_058;
	UINT32      MIPIRX_ANALOG_BASE_05C;


} _seninf_backup_reg_t;

static volatile _isp_backup_reg_t g_backupReg;

static volatile _seninf_backup_reg_t g_SeninfBackupReg;
#endif

typedef struct _isp_bk_reg {
	UINT32  CAM_TG_INTER_ST;                                 /* 453C*/
} _isp_bk_reg_t;

static _isp_bk_reg_t g_BkReg[ISP_IRQ_TYPE_AMOUNT];

/* Everest top registers */
#define CAMSYS_REG_CG_CON               (ISP_CAMSYS_CONFIG_BASE + 0x0)
#define IMGSYS_REG_CG_CON               (ISP_IMGSYS_CONFIG_BASE + 0x0)
#define CAMSYS_REG_CG_SET               (ISP_CAMSYS_CONFIG_BASE + 0x4)
#define IMGSYS_REG_CG_SET               (ISP_IMGSYS_CONFIG_BASE + 0x4)
#define CAMSYS_REG_CG_CLR               (ISP_CAMSYS_CONFIG_BASE + 0x8)
#define IMGSYS_REG_CG_CLR               (ISP_IMGSYS_CONFIG_BASE + 0x8)

/* Everest CAM registers */
#define CAM_REG_CTL_START(module)  (isp_devs[module].regs + 0x0000)
#define CAM_REG_CTL_EN(module)  (isp_devs[module].regs + 0x0004)
#define CAM_REG_CTL_DMA_EN(module)  (isp_devs[module].regs + 0x0008)
#define CAM_REG_CTL_FMT_SEL(module)  (isp_devs[module].regs + 0x000C)
#define CAM_REG_CTL_SEL(module)  (isp_devs[module].regs + 0x0010)
