#ifndef __CCU_A_REGS_H__
#define __CCU_A_REGS_H__

#include "common.h"

#ifdef __cplusplus
extern "C" {
#endif

/* ----------------- CCU_A Bit Field Definitions -------------------*/

#define PACKING
	typedef unsigned int FIELD;

	typedef PACKING union {
		PACKING struct {
			FIELD RDMA_SOFT_RST_ST:1;
			FIELD WDMA_SOFT_RST_ST:1;
			FIELD rsv_2:6;
			FIELD RDMA_SOFT_RST:1;
			FIELD WDMA_SOFT_RST:1;
			FIELD rsv_10:6;
			FIELD CCU_HW_RST:1;
			FIELD ARBITER_HW_RST:1;
			FIELD S2T_A_HW_RST:1;
			FIELD T2S_A_HW_RST:1;
			FIELD S2T_B_HW_RST:1;
			FIELD T2S_B_HW_RST:1;
			FIELD RDMA_HW_RST:1;
			FIELD WDMA_HW_RST:1;
			FIELD AHB2GMC_HW_RST:1;
			FIELD rsv_25:7;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_RESET, *PCCU_A_REG_RESET;

	typedef PACKING union {
		PACKING struct {
			FIELD rsv_0:1;
			FIELD S2T_A_START:1;
			FIELD T2S_A_START:1;
			FIELD RDMA_START:1;
			FIELD WDMA_START:1;
			FIELD rsv_5:27;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_START_TRIG, *PCCU_A_REG_START_TRIG;

	typedef PACKING union {
		PACKING struct {
			FIELD S2T_A_FINISH:1;
			FIELD T2S_A_FINISH:1;
			FIELD S2T_B_FINISH:1;
			FIELD T2S_B_FINISH:1;
			FIELD rsv_4:28;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_BANK_INCR, *PCCU_A_REG_BANK_INCR;

	typedef PACKING union {
		PACKING struct {
			FIELD S2T_B_BANK_FULL:1;
			FIELD T2S_B_BANK_FULL:1;
			FIELD rsv_2:6;
			FIELD S2T_B_BANK_ID:3;
			FIELD T2S_B_BANK_ID:3;
			FIELD rsv_14:2;
			FIELD CCU_HALT:1;
			FIELD CCU_GATED:1;
			FIELD rsv_18:6;
			FIELD T2S_A_BANK_DONE:1;
			FIELD T2S_A_FRAME_DONE:1;
			FIELD S2T_A_BANK_DONE:1;
			FIELD S2T_A_FRAME_DONE:1;
			FIELD T2S_B_BANK_DONE:1;
			FIELD T2S_B_FRAME_DONE:1;
			FIELD S2T_B_BANK_DONE:1;
			FIELD S2T_B_FRAME_DONE:1;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DONE_ST, *PCCU_A_REG_DONE_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD RDMA_ENABLE:1;
			FIELD WDMA_ENABLE:1;
			FIELD S2T_A_ENABLE:1;
			FIELD T2S_A_ENABLE:1;
			FIELD S2T_B_ENABLE:1;
			FIELD T2S_B_ENABLE:1;
			FIELD CCU_PRINNER:1;
			FIELD CCU_TILE_SOURCE:1;
			FIELD H2G_GID:2;
			FIELD H2G_GULTRA_ENABLE:1;
			FIELD H2G_EARLY_RESP:1;
			FIELD rsv_12:4;
			FIELD CCU_AHB_BASE:4;
			FIELD OCD_JTAG_BYPASS:1;
			FIELD rsv_21:3;
			FIELD OCD_EN:1;
			FIELD rsv_25:3;
			FIELD DB_LOAD_DISABLE:1;
			FIELD STR_SEL:1;
			FIELD DL_PATH_SEL:1;
			FIELD CROP_EN:1;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CTRL, *PCCU_A_REG_CTRL;

	typedef PACKING union {
		PACKING struct {
			FIELD INT_CCU:1;
			FIELD rsv_1:31;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INT, *PCCU_A_REG_CCU_INT;

	typedef PACKING union {
		PACKING struct {
			FIELD INT_CTL_CCU:1;
			FIELD rsv_1:31;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CTL_CCU_INT, *PCCU_A_REG_CTL_CCU_INT;

	typedef PACKING union {
		PACKING struct {
			FIELD CCUI_DCM_DIS:1;
			FIELD rsv_1:3;
			FIELD CCUO_DCM_DIS:1;
			FIELD rsv_5:3;
			FIELD SRAM_DCM_DIS:1;
			FIELD rsv_9:23;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DCM_DIS, *PCCU_A_REG_DCM_DIS;

	typedef PACKING union {
		PACKING struct {
			FIELD CCUI_DCM_ST:1;
			FIELD rsv_1:3;
			FIELD CCUO_DCM_ST:1;
			FIELD rsv_5:3;
			FIELD SRAM_DCM_ST:1;
			FIELD rsv_9:23;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DCM_ST, *PCCU_A_REG_DCM_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD DMA_ERR_INT:1;
			FIELD rsv_1:3;
			FIELD DMA_REQ_ST:1;
			FIELD DMA_RDY_ST:1;
			FIELD rsv_6:26;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DMA_ERR_ST, *PCCU_A_REG_DMA_ERR_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD DMA_DEBUG:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DMA_DEBUG, *PCCU_A_REG_DMA_DEBUG;

	typedef PACKING union {
		PACKING struct {
			FIELD ISP_INT_MASK:1;
			FIELD rsv_1:3;
			FIELD RDMA_INT_MASK:1;
			FIELD rsv_5:3;
			FIELD WDMA_INT_MASK:1;
			FIELD rsv_9:3;
			FIELD S2T_BANK_INT_MASK:1;
			FIELD rsv_13:3;
			FIELD T2S_BANK_INT_MASK:1;
			FIELD rsv_17:3;
			FIELD S2T_TILE_INT_MASK:1;
			FIELD rsv_21:3;
			FIELD T2S_TILE_INT_MASK:1;
			FIELD rsv_25:3;
			FIELD APMCU_INT_MASK:1;
			FIELD rsv_29:3;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_INT_MASK, *PCCU_A_REG_INT_MASK;

	typedef PACKING union {
		PACKING struct {
			FIELD A2S_EN:1;
			FIELD rsv_1:3;
			FIELD S2T_A_EN:1;
			FIELD rsv_5:3;
			FIELD T2S_A_EN:1;
			FIELD rsv_9:3;
			FIELD CCU_EN:1;
			FIELD rsv_13:19;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_PARB_ENABLE, *PCCU_A_REG_PARB_ENABLE;

	typedef PACKING union {
		PACKING struct {
			FIELD A2S_EN:1;
			FIELD rsv_1:3;
			FIELD S2T_A_EN:1;
			FIELD rsv_5:3;
			FIELD T2S_A_EN:1;
			FIELD rsv_9:3;
			FIELD S2T_B_EN:1;
			FIELD rsv_13:3;
			FIELD T2S_B_EN:1;
			FIELD rsv_17:3;
			FIELD CCU_EN:1;
			FIELD rsv_21:11;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DARB_ENABLE, *PCCU_A_REG_DARB_ENABLE;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_SPARE:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_TOP_SPARE, *PCCU_A_REG_TOP_SPARE;

	typedef PACKING union {
		PACKING struct {
			FIELD RDMA_DONE_ST:1;
			FIELD WDMA_DONE_ST:1;
			FIELD rsv_2:30;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_DMA_ST, *PCCU_A_REG_DMA_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_EINTC_MASK:8;
			FIELD rsv_8:8;
			FIELD CCU_EINTC_MODE:1;
			FIELD rsv_17:15;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_EINTC_MASK, *PCCU_A_REG_EINTC_MASK;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_EINTC_CLR:8;
			FIELD rsv_8:24;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_EINTC_CLR, *PCCU_A_REG_EINTC_CLR;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_EINTC_ST:8;
			FIELD rsv_8:24;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_EINTC_ST, *PCCU_A_REG_EINTC_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_EINTC_RAW_ST:8;
			FIELD rsv_8:8;
			FIELD CCU_EINTC_TRIG_ST:1;
			FIELD rsv_17:15;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_EINTC_MISC, *PCCU_A_REG_EINTC_MISC;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_CROP_X_SIZE:16;
			FIELD CCU_CROP_Y_SIZE:16;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CROP_SIZE, *PCCU_A_REG_CROP_SIZE;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_CROP_START_X:16;
			FIELD CCU_CROP_START_Y:16;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CROP_START, *PCCU_A_REG_CROP_START;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_CROP_END_X:16;
			FIELD CCU_CROP_END_Y:16;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CROP_END, *PCCU_A_REG_CROP_END;

	typedef PACKING union {
		PACKING struct {
			FIELD T2S_B_OVERFLOW:1;
			FIELD rsv_1:3;
			FIELD T2S_A_INCF:1;
			FIELD S2T_A_INCF:1;
			FIELD T2S_B_INCF:1;
			FIELD S2T_B_INCF:1;
			FIELD rsv_8:24;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_ERR_ST, *PCCU_A_REG_ERR_ST;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO0:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO00, *PCCU_A_REG_CCU_INFO00;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO1:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO01, *PCCU_A_REG_CCU_INFO01;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO2:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO02, *PCCU_A_REG_CCU_INFO02;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO3:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO03, *PCCU_A_REG_CCU_INFO03;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO4:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO04, *PCCU_A_REG_CCU_INFO04;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO5:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO05, *PCCU_A_REG_CCU_INFO05;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO6:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO06, *PCCU_A_REG_CCU_INFO06;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO7:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO07, *PCCU_A_REG_CCU_INFO07;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO8:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO08, *PCCU_A_REG_CCU_INFO08;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO9:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO09, *PCCU_A_REG_CCU_INFO09;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO10:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO10, *PCCU_A_REG_CCU_INFO10;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO11:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO11, *PCCU_A_REG_CCU_INFO11;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO12:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO12, *PCCU_A_REG_CCU_INFO12;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO13:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO13, *PCCU_A_REG_CCU_INFO13;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO14:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO14, *PCCU_A_REG_CCU_INFO14;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO15:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO15, *PCCU_A_REG_CCU_INFO15;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO16:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO16, *PCCU_A_REG_CCU_INFO16;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO17:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO17, *PCCU_A_REG_CCU_INFO17;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO18:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO18, *PCCU_A_REG_CCU_INFO18;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO19:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO19, *PCCU_A_REG_CCU_INFO19;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO20:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO20, *PCCU_A_REG_CCU_INFO20;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO21:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO21, *PCCU_A_REG_CCU_INFO21;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO22:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO22, *PCCU_A_REG_CCU_INFO22;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO23:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO23, *PCCU_A_REG_CCU_INFO23;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO24:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO24, *PCCU_A_REG_CCU_INFO24;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO25:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO25, *PCCU_A_REG_CCU_INFO25;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO26:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO26, *PCCU_A_REG_CCU_INFO26;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO27:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO27, *PCCU_A_REG_CCU_INFO27;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO28:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO28, *PCCU_A_REG_CCU_INFO28;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO29:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO29, *PCCU_A_REG_CCU_INFO29;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO30:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO30, *PCCU_A_REG_CCU_INFO30;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_INFO31:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_INFO31, *PCCU_A_REG_CCU_INFO31;

	typedef PACKING union {
		PACKING struct {
			FIELD CCU_CCU_PC:32;
		} Bits;
		UINT32 Raw;
	} CCU_A_REG_CCU_PC, *PCCU_A_REG_CCU_PC;

/* ----------------- CCU_A  Grouping Definitions -------------------*/
/* ----------------- CCU_A Register Definition -------------------*/
	typedef volatile PACKING struct {
		CCU_A_REG_RESET RESET;	/* 7400*/
		CCU_A_REG_START_TRIG START_TRIG;	/* 7404*/
		CCU_A_REG_BANK_INCR BANK_INCR;	/* 7408*/
		CCU_A_REG_DONE_ST DONE_ST;	/* 740C*/
		CCU_A_REG_CTRL CTRL;	/* 7410*/
		CCU_A_REG_CCU_INT CCU_INT;	/* 7414*/
		CCU_A_REG_CTL_CCU_INT CTL_CCU_INT;	/* 7418*/
		CCU_A_REG_DCM_DIS DCM_DIS;	/* 741C*/
		CCU_A_REG_DCM_ST DCM_ST;	/* 7420*/
		CCU_A_REG_DMA_ERR_ST DMA_ERR_ST;	/* 7424*/
		CCU_A_REG_DMA_DEBUG DMA_DEBUG;	/* 7428*/
		CCU_A_REG_INT_MASK INT_MASK;	/* 742C*/
		CCU_A_REG_PARB_ENABLE PARB_ENABLE;	/* 7430*/
		CCU_A_REG_DARB_ENABLE DARB_ENABLE;	/* 7434*/
		CCU_A_REG_TOP_SPARE TOP_SPARE;	/* 7438*/
		CCU_A_REG_DMA_ST DMA_ST;	/* 743C*/
		CCU_A_REG_EINTC_MASK EINTC_MASK;	/* 7440*/
		CCU_A_REG_EINTC_CLR EINTC_CLR;	/* 7444*/
		CCU_A_REG_EINTC_ST EINTC_ST;	/* 7448*/
		CCU_A_REG_EINTC_MISC EINTC_MISC;	/* 744C*/
		CCU_A_REG_CROP_SIZE CROP_SIZE;	/* 7450*/
		CCU_A_REG_CROP_START CROP_START;	/* 7454*/
		CCU_A_REG_CROP_END CROP_END;	/* 7458*/
		CCU_A_REG_ERR_ST ERR_ST;	/* 745C*/
		CCU_A_REG_CCU_INFO00 CCU_INFO00;	/* 7460*/
		CCU_A_REG_CCU_INFO01 CCU_INFO01;	/* 7464*/
		CCU_A_REG_CCU_INFO02 CCU_INFO02;	/* 7468*/
		CCU_A_REG_CCU_INFO03 CCU_INFO03;	/* 746C*/
		CCU_A_REG_CCU_INFO04 CCU_INFO04;	/* 7470*/
		CCU_A_REG_CCU_INFO05 CCU_INFO05;	/* 7474*/
		CCU_A_REG_CCU_INFO06 CCU_INFO06;	/* 7478*/
		CCU_A_REG_CCU_INFO07 CCU_INFO07;	/* 747C*/
		CCU_A_REG_CCU_INFO08 CCU_INFO08;	/* 7480*/
		CCU_A_REG_CCU_INFO09 CCU_INFO09;	/* 7484*/
		CCU_A_REG_CCU_INFO10 CCU_INFO10;	/* 7488*/
		CCU_A_REG_CCU_INFO11 CCU_INFO11;	/* 748C*/
		CCU_A_REG_CCU_INFO12 CCU_INFO12;	/* 7490*/
		CCU_A_REG_CCU_INFO13 CCU_INFO13;	/* 7494*/
		CCU_A_REG_CCU_INFO14 CCU_INFO14;	/* 7498*/
		CCU_A_REG_CCU_INFO15 CCU_INFO15;	/* 749C*/
		CCU_A_REG_CCU_INFO16 CCU_INFO16;	/* 74A0*/
		CCU_A_REG_CCU_INFO17 CCU_INFO17;	/* 74A4*/
		CCU_A_REG_CCU_INFO18 CCU_INFO18;	/* 74A8*/
		CCU_A_REG_CCU_INFO19 CCU_INFO19;	/* 74AC*/
		CCU_A_REG_CCU_INFO20 CCU_INFO20;	/* 74B0*/
		CCU_A_REG_CCU_INFO21 CCU_INFO21;	/* 74B4*/
		CCU_A_REG_CCU_INFO22 CCU_INFO22;	/* 74B8*/
		CCU_A_REG_CCU_INFO23 CCU_INFO23;	/* 74BC*/
		CCU_A_REG_CCU_INFO24 CCU_INFO24;	/* 74C0*/
		CCU_A_REG_CCU_INFO25 CCU_INFO25;	/* 74C4*/
		CCU_A_REG_CCU_INFO26 CCU_INFO26;	/* 74C8*/
		CCU_A_REG_CCU_INFO27 CCU_INFO27;	/* 74CC*/
		CCU_A_REG_CCU_INFO28 CCU_INFO28;	/* 74D0*/
		CCU_A_REG_CCU_INFO29 CCU_INFO29;	/* 74D4*/
		CCU_A_REG_CCU_INFO30 CCU_INFO30;	/* 74D8*/
		CCU_A_REG_CCU_INFO31 CCU_INFO31;	/* 74DC*/
		CCU_A_REG_CCU_PC CCU_PC;	/* 74E0*/
	} CCU_A_REGS, *PCCU_A_REGS;

#ifdef __cplusplus
}
#endif
#endif /* __CCU_A_REGS_H__*/
